import { OperatorData } from '../types';

// chubu 지역 노선
export const chubu: OperatorData = {
  "JR東日本": [
    {
        id: "11311",
        nameKo: "특급 아즈사",
        nameJp: "特急あずさ (JR中央本線)",
        color: "#8000ffff",
        stations: [
            {
                name: "新宿",
                lat: 35.689729,
                lng: 139.700464,
                transfer: true,
                groupId: 1130208,
            },
            {
                name: "立川",
                lat: 35.698202,
                lng: 139.413704,
                transfer: true,
                groupId: 1130325,
            },
            {
                name: "八王子",
                lat: 35.655555,
                lng: 139.338998,
                transfer: true,
                groupId: 1130620,
            },
            {
                name: "大月",
                lat: 35.613222,
                lng: 138.942729
            },
            {
                name: "塩山",
                lat: 35.705327,
                lng: 138.734796,
            },
            {
                name: "山梨市",
                lat: 35.684961,
                lng: 138.683003,
            },
            {
                name: "石和温泉",
                lat: 35.657603,
                lng: 138.634577,
            },
            {
                name: "甲府",
                lat: 35.667054,
                lng: 138.569015
            },
            {
                name: "韮崎",
                lat: 35.709711,
                lng: 138.451357,
            },
            {
                name: "小淵沢",
                lat: 35.863808,
                lng: 138.316351,
                transfer: true,
                groupId: 1131139,
            },
            {
                name: "富士見",
                lat: 35.912183,
                lng: 138.238071,
            },
            {
                name: "茅野",
                lat: 35.995062,
                lng: 138.151674
            },
            {
                name: "上諏訪",
                lat: 36.046618,
                lng: 138.116306
            },
            {
                name: "下諏訪",
                lat: 36.071948,
                lng: 138.084953,
            },
            {
                name: "岡谷",
                lat: 36.056693,
                lng: 138.045001,
            },
            {
                name: "川岸",
                lat: 36.03296,
                lng: 138.021937,
            },
            {
                name: "辰野",
                lat: 35.984565,
                lng: 137.997238,
                transfer: true,
                groupId: 1131150,
            },
            {
                name: "信濃川島",
                lat: 36.013642,
                lng: 137.97185,
            },
            {
                name: "小野",
                lat: 36.04693,
                lng: 137.9706,
            },
            {
                name: "みどり湖",
                lat: 36.094176,
                lng: 137.981928,
            },
            {
                name: "塩尻",
                lat: 36.114364,
                lng: 137.947961,
                transfer: true,
                groupId: 1131153,
            },
            {
                name: "松本",
                lat: 36.230393,
                lng: 137.96445,
                transfer: true,
            },
        ],
    },
    {
        id: "11412",
        nameKo: "시노노이선",
        nameJp: "JR篠ノ井線",
        color: "#e9af00ff",
        stations: [
            {
                name: "塩尻",
                lat: 36.114364,
                lng: 137.947961,
                transfer: true,
                groupId: 1131153,
            },
            {
                name: "広丘",
                lat: 36.148032,
                lng: 137.949578,
            },
            {
                name: "村井",
                lat: 36.174226,
                lng: 137.956007,
            },
            {
                name: "平田",
                lat: 36.191161,
                lng: 137.962017,
            },
            {
                name: "南松本",
                lat: 36.210447,
                lng: 137.969505,
            },
            {
                name: "松本",
                lat: 36.230393,
                lng: 137.96445,
                transfer: true,
                groupId: 1140901,
            },
            {
                name: "田沢",
                lat: 36.301583,
                lng: 137.941029,
            },
            {
                name: "明科",
                lat: 36.353948,
                lng: 137.929967,
            },
            {
                name: "西条",
                lat: 36.400353,
                lng: 138.012377,
            },
            {
                name: "坂北",
                lat: 36.430663,
                lng: 138.015754,
            },
            {
                name: "聖高原",
                lat: 36.455069,
                lng: 138.047603,
            },
            {
                name: "冠着",
                lat: 36.457215,
                lng: 138.079223,
            },
            {
                name: "姨捨",
                lat: 36.502649,
                lng: 138.093388,
            },
            {
                name: "稲荷山",
                lat: 36.552633,
                lng: 138.108061,
            },
            {
                name: "篠ノ井",
                lat: 36.5771,
                lng: 138.138046,
                transfer: true,
                groupId: 1140301,
            },
        ],
    },
    {
        id: "11403",
        nameKo: "신에쓰 본선 (시노노이~나가노)",
        nameJp: "JR信越本線(篠ノ井～長野)",
        color: "#00A0E9",
        stations: [
            {
                name: "篠ノ井",
                lat: 36.5771,
                lng: 138.138046,
                transfer: true,
                groupId: 1140301,
            },
            {
                name: "今井",
                lat: 36.595732,
                lng: 138.145347,
            },
            {
                name: "川中島",
                lat: 36.614167,
                lng: 138.150679,
            },
            {
                name: "安茂里",
                lat: 36.630262,
                lng: 138.161791,
            },
            {
                name: "長野",
                lat: 36.643307,
                lng: 138.189101,
                transfer: true,
                groupId: 1140305,
            },
        ],
    },
    {
        id: "11409",
        nameKo: "오이토선 (북알프스선)",
        nameJp: "JR大糸線",
        color: "#00e5e9ff",
        stations: [
            {
                name: "松本",
                lat: 36.230393,
                lng: 137.96445,
                transfer: true,
                groupId: 1140901,
            },
            {
                name: "北松本",
                lat: 36.236971,
                lng: 137.960983,
            },
            {
                name: "島内",
                lat: 36.246991,
                lng: 137.944817,
            },
            {
                name: "島高松",
                lat: 36.246322,
                lng: 137.931576,
            },
            {
                name: "梓橋",
                lat: 36.250162,
                lng: 137.918027,
            },
            {
                name: "一日市場",
                lat: 36.2596,
                lng: 137.904136,
            },
            {
                name: "中萱",
                lat: 36.273434,
                lng: 137.903353,
            },
            {
                name: "南豊科",
                lat: 36.291124,
                lng: 137.903457,
            },
            {
                name: "豊科",
                lat: 36.299957,
                lng: 137.900896,
            },
            {
                name: "柏矢町",
                lat: 36.322529,
                lng: 137.888349,
            },
            {
                name: "穂高",
                lat: 36.33906,
                lng: 137.881869,
            },
            {
                name: "有明",
                lat: 36.359949,
                lng: 137.878236,
            },
            {
                name: "安曇追分",
                lat: 36.371795,
                lng: 137.872736,
            },
            {
                name: "細野",
                lat: 36.397107,
                lng: 137.865722,
            },
            {
                name: "北細野",
                lat: 36.406439,
                lng: 137.862725,
            },
            {
                name: "信濃松川",
                lat: 36.424456,
                lng: 137.858631,
            },
            {
                name: "安曇沓掛",
                lat: 36.447795,
                lng: 137.854784,
            },
            {
                name: "信濃常盤",
                lat: 36.467403,
                lng: 137.847148,
            },
            {
                name: "南大町",
                lat: 36.491536,
                lng: 137.856269,
            },
            {
                name: "信濃大町",
                lat: 36.50031,
                lng: 137.861674,
            },
            {
                name: "北大町",
                lat: 36.517558,
                lng: 137.857913,
            },
            {
                name: "信濃木崎",
                lat: 36.535643,
                lng: 137.846189,
            },
            {
                name: "稲尾",
                lat: 36.554058,
                lng: 137.842575,
            },
            {
                name: "海ノ口",
                lat: 36.565652,
                lng: 137.841824,
            },
            {
                name: "簗場",
                lat: 36.594666,
                lng: 137.844724,
            },
            {
                name: "南神城",
                lat: 36.637105,
                lng: 137.841551,
            },
            {
                name: "神城",
                lat: 36.658287,
                lng: 137.846586,
            },
            {
                name: "飯森",
                lat: 36.670563,
                lng: 137.85006,
            },
            {
                name: "白馬",
                lat: 36.695922,
                lng: 137.863819,
            },
            {
                name: "信濃森上",
                lat: 36.707134,
                lng: 137.869883,
            },
            {
                name: "白馬大池",
                lat: 36.719682,
                lng: 137.877972,
            },
            {
                name: "千国",
                lat: 36.763249,
                lng: 137.900895,
            },
            {
                name: "南小谷",
                lat: 36.774604,
                lng: 137.908372,
            },
        ],
    },
    {
        id: "11407",
        nameKo: "이이야마선",
        nameJp: "JR飯山線",
        color: "#00A0E9",
        stations: [
            {
                name: "長野",
                lat: 36.643307,
                lng: 138.189101,
                transfer: true,
                groupId: 1140305,
            },
            {
                name: "北長野",
                lat: 36.665123,
                lng: 138.222534,
                transfer: true,
                groupId: 1140306,
            },
            {
                name: "三才",
                lat: 36.686674,
                lng: 138.244079,
                transfer: true,
                groupId: 1140307,
            },
            {
                name: "豊野",
                lat: 36.710642,
                lng: 138.274458,
                transfer: true,
                groupId: 1140308,
            },
            {
                name: "信濃浅野",
                lat: 36.722011,
                lng: 138.294784,
            },
            {
                name: "立ケ花",
                lat: 36.731257,
                lng: 138.307057,
            },
            {
                name: "上今井",
                lat: 36.753947,
                lng: 138.319478,
            },
            {
                name: "替佐",
                lat: 36.768999,
                lng: 138.323385,
            },
            {
                name: "蓮",
                lat: 36.80888,
                lng: 138.349026,
            },
            {
                name: "飯山",
                lat: 36.847642,
                lng: 138.359335,
            },
            {
                name: "北飯山",
                lat: 36.85883,
                lng: 138.363765,
            },
            {
                name: "信濃平",
                lat: 36.884918,
                lng: 138.378479,
            },
            {
                name: "戸狩野沢温泉",
                lat: 36.916673,
                lng: 138.392952,
            },
            {
                name: "上境",
                lat: 36.937916,
                lng: 138.419151,
            },
            {
                name: "上桑名川",
                lat: 36.962559,
                lng: 138.441204,
            },
            {
                name: "桑名川",
                lat: 36.975882,
                lng: 138.458007,
            },
            {
                name: "西大滝",
                lat: 36.979169,
                lng: 138.480872,
            },
            {
                name: "信濃白鳥",
                lat: 36.983591,
                lng: 138.50302,
            },
            {
                name: "平滝",
                lat: 36.986041,
                lng: 138.533723,
            },
            {
                name: "横倉",
                lat: 36.979875,
                lng: 138.55031,
            },
            {
                name: "森宮野原",
                lat: 36.988159,
                lng: 138.577293,
            },
            {
                name: "飯山線",
                lat: 37.011156,
                lng: 138.591622,
            },
            {
                name: "越後田沢",
                lat: 37.043063,
                lng: 138.619354,
            },
            {
                name: "津南",
                lat: 37.034753,
                lng: 138.653766,
            },
            {
                name: "越後鹿渡",
                lat: 37.02691,
                lng: 138.699776,
            },
            {
                name: "十日町",
                lat: 37.127461,
                lng: 138.755197,
            },
            {
                name: "魚沼中条",
                lat: 37.159467,
                lng: 138.772491,
            },
            {
                name: "下条",
                lat: 37.198324,
                lng: 138.779989,
            },
            {
                name: "越後岩沢",
                lat: 37.240753,
                lng: 138.797097,
            },
            {
                name: "内ケ巻",
                lat: 37.250008,
                lng: 138.851833,
            },
            {
                name: "越後川口",
                lat: 37.272983,
                lng: 138.861514,
            },
        ],
    },
    {
        id: "11401",
        nameKo: "코우미선",
        nameJp: "JR小海線",
        color: "#00A0E9",
        stations: [
            {
                name: "小淵沢",
                lat: 35.863808,
                lng: 138.316351,
                transfer: true,
                groupId: 1131139,
            },
            {
                name: "甲斐小泉",
                lat: 35.879533,
                lng: 138.359402,
            },
            {
                name: "甲斐大泉",
                lat: 35.89624,
                lng: 138.409564,
            },
            {
                name: "清里",
                lat: 35.919093,
                lng: 138.436589,
            },
            {
                name: "野辺山",
                lat: 35.955289,
                lng: 138.474448,
            },
            {
                name: "信濃川上",
                lat: 35.975939,
                lng: 138.527345,
            },
            {
                name: "佐久広瀬",
                lat: 36.003724,
                lng: 138.519349,
            },
            {
                name: "佐久海ノ口",
                lat: 36.021128,
                lng: 138.490807,
            },
            {
                name: "海尻",
                lat: 36.041276,
                lng: 138.473536,
            },
            {
                name: "松原湖",
                lat: 36.060995,
                lng: 138.470509,
            },
            {
                name: "小海",
                lat: 36.08862,
                lng: 138.482806,
            },
            {
                name: "馬流",
                lat: 36.101824,
                lng: 138.485963,
            },
            {
                name: "高岩",
                lat: 36.115711,
                lng: 138.477438,
            },
            {
                name: "八千穂",
                lat: 36.133281,
                lng: 138.477345,
            },
            {
                name: "海瀬",
                lat: 36.155743,
                lng: 138.485894,
            },
            {
                name: "羽黒下",
                lat: 36.166411,
                lng: 138.489618,
            },
            {
                name: "青沼",
                lat: 36.181259,
                lng: 138.489162,
            },
            {
                name: "臼田",
                lat: 36.194013,
                lng: 138.488309,
            },
            {
                name: "龍岡城",
                lat: 36.204184,
                lng: 138.490708,
            },
            {
                name: "太田部",
                lat: 36.220307,
                lng: 138.4878,
            },
            {
                name: "中込",
                lat: 36.230437,
                lng: 138.480461,
            },
            {
                name: "滑津",
                lat: 36.238716,
                lng: 138.475003,
            },
            {
                name: "北中込",
                lat: 36.254923,
                lng: 138.476661,
            },
            {
                name: "岩村田",
                lat: 36.27446,
                lng: 138.4724,
            },
            {
                name: "佐久平",
                lat: 36.277929,
                lng: 138.464367,
            },
            {
                name: "中佐都",
                lat: 36.280856,
                lng: 138.453549,
            },
            {
                name: "美里",
                lat: 36.292243,
                lng: 138.450177,
            },
            {
                name: "三岡",
                lat: 36.30415,
                lng: 138.44846,
            },
            {
                name: "乙女",
                lat: 36.311371,
                lng: 138.440527,
            },
            {
                name: "東小諸",
                lat: 36.317057,
                lng: 138.432144,
            },
            {
                name: "小諸",
                lat: 36.326337,
                lng: 138.422021,
                transfer: true,
                groupId: 1140131,
            },
        ],
    },
    {
        id: "11414",
        nameKo: "이다선 (덴류쿄~타츠노)",
        nameJp: "JR飯田線(天竜峡～辰野)",
        color: "#9dff00ff",
        stations: [
            {
                name: "天竜峡",
                lat: 35.441114,
                lng: 137.81732,
                transfer: true,
                groupId: 1141351,
            },
            {
                name: "川路",
                lat: 35.452946,
                lng: 137.815564,
            },
            {
                name: "時又",
                lat: 35.46402,
                lng: 137.82776,
            },
            {
                name: "駄科",
                lat: 35.4754,
                lng: 137.839625,
            },
            {
                name: "毛賀",
                lat: 35.487445,
                lng: 137.839332,
            },
            {
                name: "伊那八幡",
                lat: 35.49683,
                lng: 137.84154,
            },
            {
                name: "下山村",
                lat: 35.50426,
                lng: 137.83959,
            },
            {
                name: "鼎",
                lat: 35.506726,
                lng: 137.828383,
            },
            {
                name: "切石",
                lat: 35.512339,
                lng: 137.809098,
            },
            {
                name: "飯田",
                lat: 35.519544,
                lng: 137.821244,
            },
            {
                name: "桜町",
                lat: 35.522147,
                lng: 137.829601,
            },
            {
                name: "伊那上郷",
                lat: 35.520164,
                lng: 137.838984,
            },
            {
                name: "元善光寺",
                lat: 35.533843,
                lng: 137.861375,
            },
            {
                name: "下市田",
                lat: 35.544165,
                lng: 137.87641,
            },
            {
                name: "市田",
                lat: 35.549325,
                lng: 137.886578,
            },
            {
                name: "下平",
                lat: 35.572597,
                lng: 137.895922,
            },
            {
                name: "山吹",
                lat: 35.577758,
                lng: 137.903282,
            },
            {
                name: "伊那大島",
                lat: 35.595698,
                lng: 137.913222,
            },
            {
                name: "上片桐",
                lat: 35.617583,
                lng: 137.904064,
            },
            {
                name: "伊那田島",
                lat: 35.627221,
                lng: 137.910338,
            },
            {
                name: "高遠原",
                lat: 35.644693,
                lng: 137.90055,
            },
            {
                name: "七久保",
                lat: 35.654645,
                lng: 137.911346,
            },
            {
                name: "伊那本郷",
                lat: 35.66543,
                lng: 137.93248,
            },
            {
                name: "飯島",
                lat: 35.677571,
                lng: 137.929004,
            },
            {
                name: "田切",
                lat: 35.695613,
                lng: 137.933092,
            },
            {
                name: "伊那福岡",
                lat: 35.712233,
                lng: 137.93398,
            },
            {
                name: "小町屋",
                lat: 35.726781,
                lng: 137.935207,
            },
            {
                name: "駒ケ根",
                lat: 35.736219,
                lng: 137.936862,
            },
            {
                name: "大田切",
                lat: 35.748162,
                lng: 137.940159,
            },
            {
                name: "宮田",
                lat: 35.76726,
                lng: 137.938897,
            },
            {
                name: "赤木",
                lat: 35.777887,
                lng: 137.943943,
            },
            {
                name: "沢渡",
                lat: 35.803681,
                lng: 137.944035,
            },
            {
                name: "下島",
                lat: 35.812706,
                lng: 137.940055,
            },
            {
                name: "伊那市",
                lat: 35.838435,
                lng: 137.959196,
            },
            {
                name: "伊那北",
                lat: 35.84524,
                lng: 137.964368,
            },
            {
                name: "田畑",
                lat: 35.860791,
                lng: 137.97781,
            },
            {
                name: "北殿",
                lat: 35.879377,
                lng: 137.984059,
            },
            {
                name: "木ノ下",
                lat: 35.900892,
                lng: 137.988022,
            },
            {
                name: "伊那松島",
                lat: 35.913865,
                lng: 137.988647,
            },
            {
                name: "沢",
                lat: 35.936385,
                lng: 137.985477,
            },
            {
                name: "羽場",
                lat: 35.953094,
                lng: 137.985126,
            },
            {
                name: "伊那新町",
                lat: 35.9688,
                lng: 137.984056,
            },
            {
                name: "宮木",
                lat: 35.976247,
                lng: 137.990509,
            },
            {
                name: "辰野",
                lat: 35.984565,
                lng: 137.997238,
                transfer: true,
                groupId: 1131150,
            },
        ],
    },
    {
        id: "11413",
        nameKo: "이다선 (도요하시~덴류쿄)",
        nameJp: "JR飯田線(豊橋～天竜峡)",
        color: "#0099ffff",
        stations: [
            {
                name: "豊橋",
                lat: 34.762734,
                lng: 137.382128,
                transfer: true,
                groupId: 1141301,
            },
            {
                name: "船町",
                lat: 34.775809,
                lng: 137.374001,
            },
            {
                name: "下地",
                lat: 34.780939,
                lng: 137.370612,
            },
            {
                name: "小坂井",
                lat: 34.797544,
                lng: 137.363056,
            },
            {
                name: "牛久保",
                lat: 34.808563,
                lng: 137.381671,
            },
            {
                name: "豊川",
                lat: 34.822519,
                lng: 137.397157,
                transfer: true,
                groupId: 1141306,
            },
            {
                name: "三河一宮",
                lat: 34.847911,
                lng: 137.414549,
            },
            {
                name: "長山",
                lat: 34.864449,
                lng: 137.431458,
            },
            {
                name: "江島",
                lat: 34.868029,
                lng: 137.441518,
            },
            {
                name: "東上",
                lat: 34.876278,
                lng: 137.455236,
            },
            {
                name: "野田城",
                lat: 34.889282,
                lng: 137.477861,
            },
            {
                name: "新城",
                lat: 34.901112,
                lng: 137.49304,
            },
            {
                name: "東新町",
                lat: 34.906129,
                lng: 137.502928,
            },
            {
                name: "茶臼山",
                lat: 34.910334,
                lng: 137.514424,
            },
            {
                name: "三河東郷",
                lat: 34.912224,
                lng: 137.527242,
            },
            {
                name: "大海",
                lat: 34.930164,
                lng: 137.548682,
            },
            {
                name: "鳥居",
                lat: 34.920834,
                lng: 137.551537,
            },
            {
                name: "長篠城",
                lat: 34.92599,
                lng: 137.565,
            },
            {
                name: "本長篠",
                lat: 34.932664,
                lng: 137.576848,
            },
            {
                name: "三河大野",
                lat: 34.952038,
                lng: 137.602987,
            },
            {
                name: "湯谷温泉",
                lat: 34.970516,
                lng: 137.613026,
            },
            {
                name: "三河槙原",
                lat: 34.988589,
                lng: 137.621022,
            },
            {
                name: "柿平",
                lat: 34.990587,
                lng: 137.644048,
            },
            {
                name: "三河川合",
                lat: 35.001722,
                lng: 137.663991,
            },
            {
                name: "池場",
                lat: 35.024418,
                lng: 137.704066,
            },
            {
                name: "東栄",
                lat: 35.02901,
                lng: 137.713812,
            },
            {
                name: "出馬",
                lat: 35.049322,
                lng: 137.744276,
            },
            {
                name: "上市場",
                lat: 35.050202,
                lng: 137.752364,
            },
            {
                name: "浦川",
                lat: 35.056355,
                lng: 137.763608,
            },
            {
                name: "早瀬",
                lat: 35.060521,
                lng: 137.775126,
            },
            {
                name: "下川合",
                lat: 35.069321,
                lng: 137.786422,
            },
            {
                name: "中部天竜",
                lat: 35.085283,
                lng: 137.802898,
            },
            {
                name: "佐久間",
                lat: 35.091877,
                lng: 137.809783,
            },
            {
                name: "相月",
                lat: 35.114988,
                lng: 137.854345,
            },
            {
                name: "城西",
                lat: 35.131569,
                lng: 137.86198,
            },
            {
                name: "向市場",
                lat: 35.154067,
                lng: 137.869446,
            },
            {
                name: "水窪",
                lat: 35.163371,
                lng: 137.870501,
            },
            {
                name: "大嵐",
                lat: 35.190466,
                lng: 137.818509,
            },
            {
                name: "小和田",
                lat: 35.209862,
                lng: 137.835971,
            },
            {
                name: "中井侍",
                lat: 35.235913,
                lng: 137.834912,
            },
            {
                name: "伊那小沢",
                lat: 35.25406,
                lng: 137.834709,
            },
            {
                name: "鶯巣",
                lat: 35.267286,
                lng: 137.832595,
            },
            {
                name: "平岡",
                lat: 35.273652,
                lng: 137.853574,
            },
            {
                name: "為栗",
                lat: 35.311687,
                lng: 137.848503,
            },
            {
                name: "温田",
                lat: 35.336273,
                lng: 137.841294,
            },
            {
                name: "田本",
                lat: 35.348988,
                lng: 137.837922,
            },
            {
                name: "門島",
                lat: 35.375306,
                lng: 137.814151,
            },
            {
                name: "唐笠",
                lat: 35.402338,
                lng: 137.810254,
            },
            {
                name: "金野",
                lat: 35.419128,
                lng: 137.817149,
            },
            {
                name: "千代",
                lat: 35.428949,
                lng: 137.816754,
            },
            {
                name: "天竜峡",
                lat: 35.441114,
                lng: 137.81732,
                transfer: true,
                groupId: 1141351,
            },
        ],
    },
  ],
  "JR東海": [
    {
      id: "11502",
      nameKo: "도카이도 본선 (하마마쓰~기후)",
      nameJp: "JR東海道本線(浜松～岐阜)",
      color: "#EF7C00",
      stations: [
        {
          name: "浜松",
          lat: 34.703866,
          lng: 137.734759,
        },
        {
          name: "高塚",
          lat: 34.690425,
          lng: 137.681303,
        },
        {
          name: "舞阪",
          lat: 34.685701,
          lng: 137.626422,
        },
        {
          name: "弁天島",
          lat: 34.690125,
          lng: 137.603058,
        },
        {
          name: "新居町",
          lat: 34.694276,
          lng: 137.568953,
        },
        {
          name: "鷲津",
          lat: 34.716819,
          lng: 137.546116,
        },
        {
          name: "新所原",
          lat: 34.723205,
          lng: 137.484399,
        },
        {
          name: "二川",
          lat: 34.725809,
          lng: 137.438966,
        },
        {
          name: "豊橋",
          lat: 34.762734,
          lng: 137.382128,
          transfer: true,
          groupId: 1141301,
        },
        {
          name: "西小坂井",
          lat: 34.79708,
          lng: 137.352499,
        },
        {
          name: "愛知御津",
          lat: 34.812624,
          lng: 137.316492,
        },
        {
          name: "三河大塚",
          lat: 34.815744,
          lng: 137.28287,
        },
        {
          name: "三河三谷",
          lat: 34.818546,
          lng: 137.247795,
        },
        {
          name: "蒲郡",
          lat: 34.823078,
          lng: 137.226459,
          transfer: true,
          groupId: 1150215,
        },
        {
          name: "三河塩津",
          lat: 34.825295,
          lng: 137.201261,
          transfer: true,
          groupId: 1150216,
        },
        {
          name: "三ケ根",
          lat: 34.836449,
          lng: 137.176348,
        },
        {
          name: "幸田",
          lat: 34.859926,
          lng: 137.16447,
        },
        {
          name: "相見",
          lat: 34.886833,
          lng: 137.160389,
        },
        {
          name: "岡崎",
          lat: 34.925417,
          lng: 137.157243,
          transfer: true,
          groupId: 1150219,
        },
        {
          name: "西岡崎",
          lat: 34.946572,
          lng: 137.123187,
        },
        {
          name: "安城",
          lat: 34.959986,
          lng: 137.08716,
        },
        {
          name: "三河安城",
          lat: 34.96968,
          lng: 137.060918,
        },
        {
          name: "東刈谷",
          lat: 34.97741,
          lng: 137.043525,
        },
        {
          name: "野田新町",
          lat: 34.984212,
          lng: 137.026355,
        },
        {
          name: "刈谷",
          lat: 34.991156,
          lng: 137.008878,
          transfer: true,
          groupId: 1150224,
        },
        {
          name: "逢妻",
          lat: 34.998215,
          lng: 136.990544,
        },
        {
          name: "大府",
          lat: 35.008665,
          lng: 136.961727,
          transfer: true,
          groupId: 1150226,
        },
        {
          name: "共和",
          lat: 35.035245,
          lng: 136.954599,
        },
        {
          name: "南大高",
          lat: 35.055403,
          lng: 136.948244,
        },
        {
          name: "大高",
          lat: 35.069244,
          lng: 136.940242,
        },
        {
          name: "笠寺",
          lat: 35.095113,
          lng: 136.926321,
        },
        {
          name: "熱田",
          lat: 35.130028,
          lng: 136.910502,
        },
        {
          name: "金山",
          lat: 35.143323,
          lng: 136.90075,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "尾頭橋",
          lat: 35.146981,
          lng: 136.89102,
        },
        {
          name: "名古屋",
          lat: 35.170694,
          lng: 136.881637,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "枇杷島",
          lat: 35.198681,
          lng: 136.861816,
          transfer: true,
          groupId: 1150234,
        },
        {
          name: "清洲",
          lat: 35.225406,
          lng: 136.834529,
        },
        {
          name: "稲沢",
          lat: 35.252994,
          lng: 136.820942,
        },
        {
          name: "尾張一宮",
          lat: 35.301765,
          lng: 136.797567,
          transfer: true,
          groupId: 1150237,
        },
        {
          name: "木曽川",
          lat: 35.349319,
          lng: 136.780726,
        },
        {
          name: "岐阜",
          lat: 35.409532,
          lng: 136.756514,
          transfer: true,
          groupId: 1141601,
        },
      ],
    },
    {
      id: "11503",
      nameKo: "도카이도 본선 (기후~마이바라)",
      nameJp: "JR東海道本線(岐阜～美濃赤坂・米原)",
      color: "#EF7C00",
      stations: [
        {
          name: "岐阜",
          lat: 35.409532,
          lng: 136.756514,
          transfer: true,
          groupId: 1141601,
        },
        {
          name: "西岐阜",
          lat: 35.404664,
          lng: 136.72341,
        },
        {
          name: "穂積",
          lat: 35.396345,
          lng: 136.693834,
        },
        {
          name: "大垣",
          lat: 35.367096,
          lng: 136.618288,
        },
        {
          name: "荒尾",
          lat: 35.373454,
          lng: 136.583276,
        },
        {
          name: "美濃赤坂",
          lat: 35.386677,
          lng: 136.582129,
        },
        {
          name: "垂井",
          lat: 35.369587,
          lng: 136.531246,
        },
        {
          name: "関ケ原",
          lat: 35.363726,
          lng: 136.470451,
        },
        {
          name: "柏原",
          lat: 35.344593,
          lng: 136.402767,
        },
        {
          name: "近江長岡",
          lat: 35.359307,
          lng: 136.373775,
        },
        {
          name: "醒ケ井",
          lat: 35.327664,
          lng: 136.345135,
        },
        {
          name: "米原",
          lat: 35.314657,
          lng: 136.289992,
          transfer: true,
          groupId: 1141501,
        },
      ],
    },
    {
      id: "11506",
      nameKo: "다케토요선",
      nameJp: "JR武豊線",
      color: "#0072BC",
      stations: [
        {
          name: "大府",
          lat: 35.008665,
          lng: 136.961727,
          transfer: true,
          groupId: 1150226,
        },
        {
          name: "尾張森岡",
          lat: 34.993826,
          lng: 136.970279,
        },
        {
          name: "緒川",
          lat: 34.981372,
          lng: 136.971899,
        },
        {
          name: "石浜",
          lat: 34.967813,
          lng: 136.972932,
        },
        {
          name: "東浦",
          lat: 34.949574,
          lng: 136.970725,
        },
        {
          name: "亀崎",
          lat: 34.918986,
          lng: 136.961058,
        },
        {
          name: "乙川",
          lat: 34.903306,
          lng: 136.941344,
        },
        {
          name: "半田",
          lat: 34.894167,
          lng: 136.930462,
        },
        {
          name: "東成岩",
          lat: 34.874279,
          lng: 136.923416,
        },
        {
          name: "武豊",
          lat: 34.853507,
          lng: 136.921244,
        },
      ],
    },
    {
      id: "11507",
      nameKo: "다이타선",
      nameJp: "JR太多線",
      color: "#E4007F",
      stations: [
        {
          name: "多治見",
          lat: 35.334774,
          lng: 137.120294,
          transfer: true,
          groupId: 1141113,
        },
        {
          name: "小泉",
          lat: 35.349055,
          lng: 137.100421,
        },
        {
          name: "根本",
          lat: 35.361548,
          lng: 137.090008,
        },
        {
          name: "姫",
          lat: 35.382004,
          lng: 137.072078,
        },
        {
          name: "下切",
          lat: 35.393777,
          lng: 137.063734,
        },
        {
          name: "可児",
          lat: 35.422832,
          lng: 137.055345,
          transfer: true,
          groupId: 1150706,
        },
        {
          name: "美濃川合",
          lat: 35.444138,
          lng: 137.045309,
        },
        {
          name: "美濃太田",
          lat: 35.445617,
          lng: 137.019467,
        },
      ],
    },
    {
      id: "11411",
      nameKo: "주오 본선 (나고야~시오지리)",
      nameJp: "JR中央本線(名古屋～塩尻)",
      color: "#0075C2",
      stations: [
        {
          name: "名古屋",
          lat: 35.170694,
          lng: 136.881637,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "金山",
          lat: 35.142928,
          lng: 136.900517,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "鶴舞",
          lat: 35.156416,
          lng: 136.917436,
          transfer: true,
          groupId: 1141103,
        },
        {
          name: "千種",
          lat: 35.170168,
          lng: 136.930665,
          transfer: true,
          groupId: 1141104,
        },
        {
          name: "大曽根",
          lat: 35.191508,
          lng: 136.937161,
          transfer: true,
          groupId: 1141105,
        },
        {
          name: "新守山",
          lat: 35.207283,
          lng: 136.951207,
        },
        {
          name: "勝川",
          lat: 35.22982,
          lng: 136.956285,
          transfer: true,
          groupId: 1141107,
        },
        {
          name: "春日井",
          lat: 35.243139,
          lng: 136.985307,
        },
        {
          name: "神領",
          lat: 35.256234,
          lng: 137.010006,
        },
        {
          name: "高蔵寺",
          lat: 35.26434,
          lng: 137.043766,
          transfer: true,
          groupId: 1141110,
        },
        {
          name: "定光寺",
          lat: 35.278015,
          lng: 137.080981,
        },
        {
          name: "古虎渓",
          lat: 35.302955,
          lng: 137.101011,
        },
        {
          name: "多治見",
          lat: 35.334774,
          lng: 137.120294,
          transfer: true,
          groupId: 1141113,
        },
        {
          name: "土岐市",
          lat: 35.359708,
          lng: 137.182082,
        },
        {
          name: "瑞浪",
          lat: 35.369081,
          lng: 137.252017,
        },
        {
          name: "釜戸",
          lat: 35.411103,
          lng: 137.30501,
        },
        {
          name: "武並",
          lat: 35.437938,
          lng: 137.35417,
        },
        {
          name: "恵那",
          lat: 35.455063,
          lng: 137.407764,
        },
        {
          name: "美乃坂本",
          lat: 35.479286,
          lng: 137.450364,
        },
        {
          name: "中津川",
          lat: 35.50036,
          lng: 137.502867,
        },
        {
          name: "落合川",
          lat: 35.525116,
          lng: 137.530034,
        },
        {
          name: "坂下",
          lat: 35.574218,
          lng: 137.531094,
        },
        {
          name: "田立",
          lat: 35.588281,
          lng: 137.54893,
        },
        {
          name: "南木曽",
          lat: 35.598896,
          lng: 137.608672,
        },
        {
          name: "十二兼",
          lat: 35.645418,
          lng: 137.617569,
        },
        {
          name: "野尻",
          lat: 35.673042,
          lng: 137.636152,
        },
        {
          name: "大桑",
          lat: 35.684477,
          lng: 137.664224,
        },
        {
          name: "須原",
          lat: 35.69769,
          lng: 137.694844,
        },
        {
          name: "倉本",
          lat: 35.732939,
          lng: 137.714338,
        },
        {
          name: "上松",
          lat: 35.784068,
          lng: 137.693283,
        },
        {
          name: "木曽福島",
          lat: 35.843669,
          lng: 137.69343,
        },
        {
          name: "原野",
          lat: 35.871245,
          lng: 137.741536,
        },
        {
          name: "宮ノ越",
          lat: 35.888337,
          lng: 137.763794,
        },
        {
          name: "藪原",
          lat: 35.930152,
          lng: 137.784368,
        },
        {
          name: "奈良井",
          lat: 35.969476,
          lng: 137.816195,
        },
        {
          name: "木曽平沢",
          lat: 35.979108,
          lng: 137.832613,
        },
        {
          name: "贄川",
          lat: 36.014008,
          lng: 137.86091,
        },
        {
          name: "日出塩",
          lat: 36.049004,
          lng: 137.894804,
        },
        {
          name: "洗馬",
          lat: 36.087164,
          lng: 137.916842,
        },
        {
          name: "塩尻",
          lat: 36.114364,
          lng: 137.947961,
          transfer: true,
          groupId: 1131153,
        },
      ],
    },
  ],
  "アルピコ交通": [
    {
      id: "99407",
      nameKo: "상고지선",
      nameJp: "上高地線",
      color: "#FF6600",
      stations: [
        {
          name: "松本",
          lat: 36.231081,
          lng: 137.963846,
          transfer: true,
          groupId: 1140901,
        },
        {
          name: "西松本",
          lat: 36.227111,
          lng: 137.963299
        },
        {
          name: "渚",
          lat: 36.227169,
          lng: 137.956006
        },
        {
          name: "信濃荒井",
          lat: 36.229019,
          lng: 137.949484
        },
        {
          name: "大庭",
          lat: 36.226961,
          lng: 137.941346
        },
        {
          name: "下新",
          lat: 36.22513,
          lng: 137.922564
        },
        {
          name: "北新・松本大学前",
          lat: 36.219816,
          lng: 137.913823
        },
        {
          name: "新村",
          lat: 36.216441,
          lng: 137.905304
        },
        {
          name: "三溝",
          lat: 36.212863,
          lng: 137.891469
        },
        {
          name: "森口",
          lat: 36.208136,
          lng: 137.881315
        },
        {
          name: "下島",
          lat: 36.206131,
          lng: 137.871841
        },
        {
          name: "波田",
          lat: 36.200358,
          lng: 137.856412
        },
        {
          name: "渕東",
          lat: 36.195325,
          lng: 137.840313
        },
        {
          name: "新島々",
          lat: 36.18977,
          lng: 137.821689
        }
      ]
    },
  ],
  "しなの鉄道": [
    {
      id: "99403",
      nameKo: "시나노 철도선",
      nameJp: "しなの鉄道線",
      color: "#FF0000",
      stations: [
        {
          name: "軽井沢",
          lat: 36.342889,
          lng: 138.635096,
        },
        {
          name: "中軽井沢",
          lat: 36.347576,
          lng: 138.593147
        },
        {
          name: "信濃追分",
          lat: 36.335538,
          lng: 138.558582
        },
        {
          name: "御代田",
          lat: 36.318986,
          lng: 138.50619
        },
        {
          name: "平原",
          lat: 36.308606,
          lng: 138.453926
        },
        {
          name: "小諸",
          lat: 36.326903,
          lng: 138.421715,
          transfer: true,
          groupId: 1140131,
        },
        {
          name: "滋野",
          lat: 36.342586,
          lng: 138.363543
        },
        {
          name: "田中",
          lat: 36.354433,
          lng: 138.329414
        },
        {
          name: "大屋",
          lat: 36.369566,
          lng: 138.297109
        },
        {
          name: "信濃国分寺",
          lat: 36.378592,
          lng: 138.273385
        },
        {
          name: "上田",
          lat: 36.396579,
          lng: 138.249298,
          transfer: true,
          groupId: 9940311,
        },
        {
          name: "西上田",
          lat: 36.417318,
          lng: 138.20855
        },
        {
          name: "テクノさかき",
          lat: 36.440584,
          lng: 138.188204
        },
        {
          name: "坂城",
          lat: 36.46195,
          lng: 138.181315
        },
        {
          name: "戸倉",
          lat: 36.492913,
          lng: 138.153017
        },
        {
          name: "千曲",
          lat: 36.509039,
          lng: 138.141661
        },
        {
          name: "屋代",
          lat: 36.532062,
          lng: 138.128191
        },
        {
          name: "屋代高校前",
          lat: 36.547853,
          lng: 138.132489
        },
        {
          name: "篠ノ井",
          lat: 36.5771,
          lng: 138.138046,
          transfer: true,
          groupId: 1140301,
        }
      ]
    },
    {
      id: "99427",
      nameKo: "키타시나노선",
      nameJp: "北しなの線",
      color: "#ff00aeff",
      stations: [
        {
          name: "長野",
          lat: 36.643307,
          lng: 138.189101,
          transfer: true,
          groupId: 1140305,
        },
        {
          name: "北長野",
          lat: 36.665123,
          lng: 138.222534,
          transfer: true,
          groupId: 1140306,
        },
        {
          name: "三才",
          lat: 36.686674,
          lng: 138.244079,
          transfer: true,
          groupId: 1140307,
        },
        {
          name: "豊野",
          lat: 36.710642,
          lng: 138.274458,
          transfer: true,
          groupId: 1140308,
        },
        {
          name: "牟礼",
          lat: 36.753239,
          lng: 138.247121
        },
        {
          name: "古間",
          lat: 36.792295,
          lng: 138.230461
        },
        {
          name: "黒姫",
          lat: 36.807214,
          lng: 138.197195
        },
        {
          name: "妙高高原",
          lat: 36.872175,
          lng: 138.211953,
        }
      ]
    },
  ],
  "長野電鉄": [
    {
      id: "99405",
      nameKo: "나가노선",
      nameJp: "長野電鉄長野線",
      color: "#bce600ff",
      stations: [
        {
          name: "長野",
          lat: 36.644341,
          lng: 138.188396,
          transfer: true,
          groupId: 1140305,
        },
        {
          name: "市役所前",
          lat: 36.649141,
          lng: 138.191488
        },
        {
          name: "権堂",
          lat: 36.653088,
          lng: 138.19188
        },
        {
          name: "善光寺下",
          lat: 36.658673,
          lng: 138.193513
        },
        {
          name: "本郷",
          lat: 36.662567,
          lng: 138.204014
        },
        {
          name: "桐原",
          lat: 36.665642,
          lng: 138.21303
        },
        {
          name: "信濃吉田",
          lat: 36.667428,
          lng: 138.220904
        },
        {
          name: "朝陽",
          lat: 36.666326,
          lng: 138.240635
        },
        {
          name: "附属中学前",
          lat: 36.662488,
          lng: 138.248298
        },
        {
          name: "柳原",
          lat: 36.663438,
          lng: 138.258317
        },
        {
          name: "村山",
          lat: 36.659295,
          lng: 138.279556
        },
        {
          name: "日野",
          lat: 36.655621,
          lng: 138.289574
        },
        {
          name: "須坂",
          lat: 36.656841,
          lng: 138.304239,
        },
        {
          name: "北須坂",
          lat: 36.678283,
          lng: 138.308705
        },
        {
          name: "小布施",
          lat: 36.698942,
          lng: 138.312771
        },
        {
          name: "都住",
          lat: 36.704122,
          lng: 138.322086
        },
        {
          name: "桜沢",
          lat: 36.712641,
          lng: 138.349642
        },
        {
          name: "延徳",
          lat: 36.726973,
          lng: 138.362693
        },
        {
          name: "信州中野",
          lat: 36.74476,
          lng: 138.364901
        },
        {
          name: "中野松川",
          lat: 36.750615,
          lng: 138.374252
        },
        {
          name: "信濃竹原",
          lat: 36.761045,
          lng: 138.393672
        },
        {
          name: "夜間瀬",
          lat: 36.759998,
          lng: 138.403322
        },
        {
          name: "上条",
          lat: 36.749641,
          lng: 138.407619
        },
        {
          name: "湯田中",
          lat: 36.741659,
          lng: 138.414877
        }
      ]
    },
  ],
  "上田電鉄": [
    {
      id: "99404",
      nameKo: "벳쇼선",
      nameJp: "別所線",
      color: "#E85298",
      stations: [
        {
          name: "上田",
          lat: 36.396691,
          lng: 138.24882,
          transfer: true,
          groupId: 9940311,
        },
        {
          name: "城下",
          lat: 36.392454,
          lng: 138.242712
        },
        {
          name: "三好町",
          lat: 36.391712,
          lng: 138.235585
        },
        {
          name: "赤坂上",
          lat: 36.391301,
          lng: 138.227224
        },
        {
          name: "上田原",
          lat: 36.390488,
          lng: 138.221439
        },
        {
          name: "寺下",
          lat: 36.38388,
          lng: 138.21634
        },
        {
          name: "神畑",
          lat: 36.377841,
          lng: 138.216965
        },
        {
          name: "大学前",
          lat: 36.371287,
          lng: 138.215171
        },
        {
          name: "下之郷",
          lat: 36.363249,
          lng: 138.217227
        },
        {
          name: "中塩田",
          lat: 36.363212,
          lng: 138.204728
        },
        {
          name: "塩田町",
          lat: 36.360888,
          lng: 138.198445
        },
        {
          name: "中野",
          lat: 36.360654,
          lng: 138.193438
        },
        {
          name: "舞田",
          lat: 36.359621,
          lng: 138.18288
        },
        {
          name: "八木沢",
          lat: 36.358365,
          lng: 138.175786
        },
        {
          name: "別所温泉",
          lat: 36.353121,
          lng: 138.161924
        }
      ]
    },
  ],
  "名古屋鉄道": [
    {
      id: "30001",
      nameKo: "나고야 본선",
      nameJp: "名鉄名古屋本線",
      color: "#E7211A",
      stations: [
        {
          name: "豊橋",
          lat: 34.762734,
          lng: 137.382128,
          transfer: true,
          groupId: 1141301,
        },
        {
          name: "伊奈",
          lat: 34.802857,
          lng: 137.354743,
        },
        {
          name: "小田渕",
          lat: 34.814739,
          lng: 137.34559,
        },
        {
          name: "国府",
          lat: 34.83752,
          lng: 137.328101,
          transfer: true,
          groupId: 3000104,
        },
        {
          name: "御油",
          lat: 34.846113,
          lng: 137.321443,
        },
        {
          name: "名電赤坂",
          lat: 34.859331,
          lng: 137.311152,
        },
        {
          name: "名電長沢",
          lat: 34.871623,
          lng: 137.288298,
        },
        {
          name: "本宿",
          lat: 34.893025,
          lng: 137.260014,
        },
        {
          name: "名電山中",
          lat: 34.899474,
          lng: 137.242829,
        },
        {
          name: "藤川",
          lat: 34.913304,
          lng: 137.218428,
        },
        {
          name: "美合",
          lat: 34.923763,
          lng: 137.196317,
        },
        {
          name: "男川",
          lat: 34.937461,
          lng: 137.183296,
        },
        {
          name: "東岡崎",
          lat: 34.951904,
          lng: 137.167333,
        },
        {
          name: "岡崎公園前",
          lat: 34.954984,
          lng: 137.153309,
          transfer: true,
          groupId: 3000114,
        },
        {
          name: "矢作橋",
          lat: 34.961149,
          lng: 137.139957,
        },
        {
          name: "宇頭",
          lat: 34.971367,
          lng: 137.118103,
        },
        {
          name: "新安城",
          lat: 34.986885,
          lng: 137.085443,
          transfer: true,
          groupId: 3000117,
        },
        {
          name: "牛田",
          lat: 34.999294,
          lng: 137.060946,
        },
        {
          name: "知立",
          lat: 35.006111,
          lng: 137.039722,
          transfer: true,
          groupId: 3000119,
        },
        {
          name: "一ツ木",
          lat: 35.01367,
          lng: 137.02551,
        },
        {
          name: "富士松",
          lat: 35.029759,
          lng: 137.016508,
        },
        {
          name: "豊明",
          lat: 35.041127,
          lng: 137.008161,
        },
        {
          name: "前後",
          lat: 35.05227,
          lng: 136.995665,
        },
        {
          name: "中京競馬場前",
          lat: 35.061302,
          lng: 136.98158,
        },
        {
          name: "有松",
          lat: 35.067687,
          lng: 136.971084,
        },
        {
          name: "左京山",
          lat: 35.070553,
          lng: 136.960301,
        },
        {
          name: "鳴海",
          lat: 35.079149,
          lng: 136.950096,
        },
        {
          name: "本星崎",
          lat: 35.087392,
          lng: 136.937378,
        },
        {
          name: "本笠寺",
          lat: 35.099199,
          lng: 136.933409,
        },
        {
          name: "桜",
          lat: 35.106062,
          lng: 136.934586,
        },
        {
          name: "呼続",
          lat: 35.114722,
          lng: 136.930387,
        },
        {
          name: "堀田",
          lat: 35.120251,
          lng: 136.919839,
        },
        {
          name: "神宮前",
          lat: 35.125857,
          lng: 136.912485,
          transfer: true,
          groupId: 3000133,
        },
        {
          name: "金山",
          lat: 35.142871,
          lng: 136.9013,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "山王",
          lat: 35.15233,
          lng: 136.888461,
          transfer: true,
          groupId: 3000135,
        },
        {
          name: "名鉄名古屋",
          lat: 35.169252,
          lng: 136.884187,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "栄生",
          lat: 35.183687,
          lng: 136.873051,
          transfer: true,
          groupId: 3000137,
        },
        {
          name: "東枇杷島",
          lat: 35.189808,
          lng: 136.870168,
          transfer: true,
          groupId: 3000138,
        },
        {
          name: "西枇杷島",
          lat: 35.195015,
          lng: 136.865685,
        },
        {
          name: "二ツ杁",
          lat: 35.194646,
          lng: 136.859583,
        },
        {
          name: "新川橋",
          lat: 35.195701,
          lng: 136.851989,
        },
        {
          name: "須ヶ口",
          lat: 35.198684,
          lng: 136.846229,
          transfer: true,
          groupId: 3000142,
        },
        {
          name: "丸ノ内",
          lat: 35.204742,
          lng: 136.841927,
        },
        {
          name: "新清洲",
          lat: 35.211249,
          lng: 136.835607,
        },
        {
          name: "大里",
          lat: 35.226216,
          lng: 136.818428,
        },
        {
          name: "奥田",
          lat: 35.235412,
          lng: 136.810917,
        },
        {
          name: "国府宮",
          lat: 35.254218,
          lng: 136.802963,
        },
        {
          name: "島氏永",
          lat: 35.270777,
          lng: 136.800987,
        },
        {
          name: "妙興寺",
          lat: 35.287178,
          lng: 136.798231,
        },
        {
          name: "名鉄一宮",
          lat: 35.30154,
          lng: 136.797225,
          transfer: true,
          groupId: 1150237,
        },
        {
          name: "今伊勢",
          lat: 35.31836,
          lng: 136.789273,
        },
        {
          name: "石刀",
          lat: 35.326204,
          lng: 136.785407,
        },
        {
          name: "新木曽川",
          lat: 35.342047,
          lng: 136.779421,
        },
        {
          name: "黒田",
          lat: 35.350213,
          lng: 136.777502,
        },
        {
          name: "木曽川堤",
          lat: 35.365067,
          lng: 136.770486,
        },
        {
          name: "笠松",
          lat: 35.37466,
          lng: 136.764664,
          transfer: true,
          groupId: 3000156,
        },
        {
          name: "岐南",
          lat: 35.389716,
          lng: 136.769165,
        },
        {
          name: "茶所",
          lat: 35.402048,
          lng: 136.768917,
        },
        {
          name: "加納",
          lat: 35.405209,
          lng: 136.765984,
        },
        {
          name: "名鉄岐阜",
          lat: 35.411136,
          lng: 136.760066,
          transfer: true,
          groupId: 3000160,
        },
      ],
    },
    {
      id: "30002",
      nameKo: "도요카와선",
      nameJp: "名鉄豊川線",
      color: "#E7211A",
      stations: [
        {
          name: "国府",
          lat: 34.83752,
          lng: 137.328101,
          transfer: true,
          groupId: 3000104,
        },
        {
          name: "八幡",
          lat: 34.82916,
          lng: 137.352113,
        },
        {
          name: "諏訪町",
          lat: 34.823464,
          lng: 137.370479,
        },
        {
          name: "稲荷口",
          lat: 34.818435,
          lng: 137.387703,
        },
        {
          name: "豊川稲荷",
          lat: 34.821755,
          lng: 137.396058,
          transfer: true,
          groupId: 1141306,
        },
      ],
    },
    {
      id: "30003",
      nameKo: "니시오선",
      nameJp: "名鉄西尾線",
      color: "#00A0E9",
      stations: [
        {
          name: "新安城",
          lat: 34.986885,
          lng: 137.085443,
          transfer: true,
          groupId: 3000117,
        },
        {
          name: "北安城",
          lat: 34.964677,
          lng: 137.092146,
        },
        {
          name: "南安城",
          lat: 34.951976,
          lng: 137.092457,
        },
        {
          name: "碧海古井",
          lat: 34.93723,
          lng: 137.090863,
        },
        {
          name: "堀内公園",
          lat: 34.927834,
          lng: 137.089636,
        },
        {
          name: "桜井",
          lat: 34.917477,
          lng: 137.088345,
        },
        {
          name: "南桜井",
          lat: 34.906302,
          lng: 137.07721,
        },
        {
          name: "米津",
          lat: 34.892822,
          lng: 137.060993,
        },
        {
          name: "桜町前",
          lat: 34.880107,
          lng: 137.062444,
        },
        {
          name: "西尾口",
          lat: 34.870647,
          lng: 137.062661,
        },
        {
          name: "西尾",
          lat: 34.863917,
          lng: 137.057789,
        },
        {
          name: "福地",
          lat: 34.844663,
          lng: 137.048579,
        },
        {
          name: "上横須賀",
          lat: 34.829941,
          lng: 137.071883,
        },
        {
          name: "吉良吉田",
          lat: 34.794043,
          lng: 137.071017,
          transfer: true,
          groupId: 3000315,
        },
      ],
    },
    {
      id: "30004",
      nameKo: "가마고리선",
      nameJp: "名鉄蒲郡線",
      color: "#8FC31F",
      stations: [
        {
          name: "吉良吉田",
          lat: 34.794043,
          lng: 137.071017,
          transfer: true,
          groupId: 3000315,
        },
        {
          name: "三河鳥羽",
          lat: 34.793214,
          lng: 137.104984,
        },
        {
          name: "西幡豆",
          lat: 34.792431,
          lng: 137.121271,
        },
        {
          name: "東幡豆",
          lat: 34.789693,
          lng: 137.145645,
        },
        {
          name: "こどもの国",
          lat: 34.788791,
          lng: 137.162721,
        },
        {
          name: "西浦",
          lat: 34.79003,
          lng: 137.178617,
        },
        {
          name: "形原",
          lat: 34.798607,
          lng: 137.184594,
        },
        {
          name: "三河鹿島",
          lat: 34.813313,
          lng: 137.189687,
        },
        {
          name: "蒲郡競艇場前",
          lat: 34.825545,
          lng: 137.202014,
          transfer: true,
          groupId: 1150216,
        },
        {
          name: "蒲郡",
          lat: 34.822743,
          lng: 137.226115,
          transfer: true,
          groupId: 1150215,
        },
      ],
    },
    {
      id: "30005",
      nameKo: "미카와선",
      nameJp: "名鉄三河線",
      color: "#00A0E9",
      stations: [
        {
          name: "碧南",
          lat: 34.874041,
          lng: 136.985613,
        },
        {
          name: "碧南中央",
          lat: 34.887395,
          lng: 136.989476,
        },
        {
          name: "新川町",
          lat: 34.896619,
          lng: 136.990312,
        },
        {
          name: "北新川",
          lat: 34.906018,
          lng: 136.992475,
        },
        {
          name: "高浜港",
          lat: 34.921536,
          lng: 136.989391,
        },
        {
          name: "三河高浜",
          lat: 34.930796,
          lng: 136.989954,
        },
        {
          name: "吉浜",
          lat: 34.946327,
          lng: 136.98919,
        },
        {
          name: "小垣江",
          lat: 34.9639,
          lng: 136.995455,
        },
        {
          name: "刈谷市",
          lat: 34.984803,
          lng: 136.993844,
        },
        {
          name: "刈谷",
          lat: 34.990884,
          lng: 137.008642,
          transfer: true,
          groupId: 1150224,
        },
        {
          name: "重原",
          lat: 34.994824,
          lng: 137.023727,
        },
        {
          name: "知立",
          lat: 35.006111,
          lng: 137.039722,
          transfer: true,
          groupId: 3000119,
        },
        {
          name: "三河知立",
          lat: 35.005722,
          lng: 137.054972,
        },
        {
          name: "三河八橋",
          lat: 35.010913,
          lng: 137.077147,
        },
        {
          name: "若林",
          lat: 35.026284,
          lng: 137.095851,
        },
        {
          name: "竹村",
          lat: 35.040067,
          lng: 137.11476,
        },
        {
          name: "土橋",
          lat: 35.058179,
          lng: 137.129572,
        },
        {
          name: "上挙母",
          lat: 35.071854,
          lng: 137.154453,
        },
        {
          name: "豊田市",
          lat: 35.087305,
          lng: 137.156227,
          transfer: true,
          groupId: 3000519,
        },
        {
          name: "梅坪",
          lat: 35.099654,
          lng: 137.162206,
          transfer: true,
          groupId: 3000520,
        },
        {
          name: "越戸",
          lat: 35.10769,
          lng: 137.180178,
        },
        {
          name: "平戸橋",
          lat: 35.114628,
          lng: 137.184725,
        },
        {
          name: "猿投",
          lat: 35.122613,
          lng: 137.178739,
        },
      ],
    },
    {
      id: "30006",
      nameKo: "도요타선",
      nameJp: "名鉄豊田線",
      color: "#EF858C",
      stations: [
        {
          name: "豊田市",
          lat: 35.087305,
          lng: 137.156227,
          transfer: true,
          groupId: 3000519,
        },
        {
          name: "梅坪",
          lat: 35.099654,
          lng: 137.162206,
          transfer: true,
          groupId: 3000520,
        },
        {
          name: "上豊田",
          lat: 35.116168,
          lng: 137.15535,
        },
        {
          name: "浄水",
          lat: 35.121298,
          lng: 137.137186,
        },
        {
          name: "三好ヶ丘",
          lat: 35.126918,
          lng: 137.111219,
        },
        {
          name: "黒笹",
          lat: 35.127681,
          lng: 137.091365,
        },
        {
          name: "米野木",
          lat: 35.123728,
          lng: 137.06702,
        },
        {
          name: "日進",
          lat: 35.118378,
          lng: 137.04878,
        },
        {
          name: "赤池",
          lat: 35.121097,
          lng: 137.017978,
          transfer: true,
          groupId: 3000609,
        },
      ],
    },
    {
      id: "30007",
      nameKo: "도코나메·공항선",
      nameJp: "名鉄常滑・空港線",
      color: "#0068B7",
      stations: [
        {
          name: "常滑",
          lat: 34.891167,
          lng: 136.834992,
          transfer: true,
          groupId: 3000701,
        },
        {
          name: "りんくう常滑",
          lat: 34.87967,
          lng: 136.828164,
        },
        {
          name: "中部国際空港",
          lat: 34.859262,
          lng: 136.816382,
        },
      ],
    },
    {
      id: "30008",
      nameKo: "도코나메선",
      nameJp: "名鉄常滑線",
      color: "#0068B7",
      stations: [
        {
          name: "名鉄名古屋",
          lat: 35.169252,
          lng: 136.884187,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "山王",
          lat: 35.15233,
          lng: 136.888461,
          transfer: true,
          groupId: 3000135,
        },
        {
          name: "金山",
          lat: 35.142871,
          lng: 136.9013,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "神宮前",
          lat: 35.125857,
          lng: 136.912485,
          transfer: true,
          groupId: 3000133,
        },
        {
          name: "豊田本町",
          lat: 35.113586,
          lng: 136.910877,
        },
        {
          name: "道徳",
          lat: 35.105712,
          lng: 136.909409,
        },
        {
          name: "大江",
          lat: 35.093258,
          lng: 136.912758,
          transfer: true,
          groupId: 3000807,
        },
        {
          name: "大同町",
          lat: 35.080268,
          lng: 136.909314,
        },
        {
          name: "柴田",
          lat: 35.072774,
          lng: 136.909126,
        },
        {
          name: "名和",
          lat: 35.060914,
          lng: 136.911709,
        },
        {
          name: "聚楽園",
          lat: 35.042857,
          lng: 136.90304,
        },
        {
          name: "新日鉄前",
          lat: 35.035161,
          lng: 136.899491,
        },
        {
          name: "太田川",
          lat: 35.020221,
          lng: 136.892504,
          transfer: true,
          groupId: 3000813,
        },
        {
          name: "尾張横須賀",
          lat: 35.010132,
          lng: 136.885655,
        },
        {
          name: "寺本",
          lat: 35.000191,
          lng: 136.875498,
        },
        {
          name: "朝倉",
          lat: 34.993858,
          lng: 136.863419,
        },
        {
          name: "古見",
          lat: 34.987809,
          lng: 136.856673,
        },
        {
          name: "長浦",
          lat: 34.978432,
          lng: 136.847808,
        },
        {
          name: "日長",
          lat: 34.96162,
          lng: 136.832152,
        },
        {
          name: "新舞子",
          lat: 34.949689,
          lng: 136.828669,
        },
        {
          name: "大野町",
          lat: 34.935441,
          lng: 136.827641,
        },
        {
          name: "西ノ口",
          lat: 34.926759,
          lng: 136.82663,
        },
        {
          name: "蒲池",
          lat: 34.915408,
          lng: 136.825536,
        },
        {
          name: "榎戸",
          lat: 34.90489,
          lng: 136.82822,
        },
        {
          name: "多屋",
          lat: 34.896983,
          lng: 136.830695,
        },
        {
          name: "常滑",
          lat: 34.891167,
          lng: 136.834992,
          transfer: true,
          groupId: 3000701,
        },
      ],
    },
    {
      id: "30009",
      nameKo: "고와선",
      nameJp: "名鉄河和線",
      color: "#F39800",
      stations: [
        {
          name: "太田川",
          lat: 35.020221,
          lng: 136.892504,
          transfer: true,
          groupId: 3000813,
        },
        {
          name: "高横須賀",
          lat: 35.009608,
          lng: 136.893696,
        },
        {
          name: "加木屋中ノ池",
          lat: 35,
          lng: 136.902583,
        },
        {
          name: "南加木屋",
          lat: 34.989216,
          lng: 136.906853,
        },
        {
          name: "八幡新田",
          lat: 34.973674,
          lng: 136.912578,
        },
        {
          name: "巽ヶ丘",
          lat: 34.962265,
          lng: 136.915556,
        },
        {
          name: "白沢",
          lat: 34.955219,
          lng: 136.91537,
        },
        {
          name: "坂部",
          lat: 34.941579,
          lng: 136.916562,
        },
        {
          name: "阿久比",
          lat: 34.931256,
          lng: 136.918517,
        },
        {
          name: "植大",
          lat: 34.917457,
          lng: 136.923448,
        },
        {
          name: "半田口",
          lat: 34.909111,
          lng: 136.925462,
        },
        {
          name: "住吉町",
          lat: 34.902042,
          lng: 136.925684,
        },
        {
          name: "知多半田",
          lat: 34.893931,
          lng: 136.925954,
        },
        {
          name: "成岩",
          lat: 34.886209,
          lng: 136.921879,
        },
        {
          name: "青山",
          lat: 34.878132,
          lng: 136.917,
        },
        {
          name: "上ゲ",
          lat: 34.858389,
          lng: 136.916403,
        },
        {
          name: "知多武豊",
          lat: 34.850732,
          lng: 136.916439,
        },
        {
          name: "富貴",
          lat: 34.828823,
          lng: 136.917043,
          transfer: true,
          groupId: 3000918,
        },
        {
          name: "河和口",
          lat: 34.797805,
          lng: 136.918618,
        },
        {
          name: "河和",
          lat: 34.777771,
          lng: 136.912528,
        },
      ],
    },
    {
      id: "30010",
      nameKo: "지타신선",
      nameJp: "名鉄知多新線",
      color: "#F39800",
      stations: [
        {
          name: "富貴",
          lat: 34.828823,
          lng: 136.917043,
          transfer: true,
          groupId: 3000918,
        },
        {
          name: "上野間",
          lat: 34.807284,
          lng: 136.866854,
        },
        {
          name: "美浜緑苑",
          lat: 34.80028,
          lng: 136.863063,
        },
        {
          name: "知多奥田",
          lat: 34.787617,
          lng: 136.864488,
        },
        {
          name: "野間",
          lat: 34.7723,
          lng: 136.860683,
        },
        {
          name: "内海",
          lat: 34.744631,
          lng: 136.875544,
        },
      ],
    },
    {
      id: "30011",
      nameKo: "지코선",
      nameJp: "名鉄築港線",
      color: "#920783",
      stations: [
        {
          name: "大江",
          lat: 35.093258,
          lng: 136.912758,
          transfer: true,
          groupId: 3000807,
        },
        {
          name: "東名古屋港",
          lat: 35.089091,
          lng: 136.899255,
        },
      ],
    },
    {
      id: "30012",
      nameKo: "세토선",
      nameJp: "名鉄瀬戸線",
      color: "#E85298",
      stations: [
        {
          name: "栄町",
          lat: 35.170567,
          lng: 136.908962,
          transfer: true,
          groupId: 3001201,
        },
        {
          name: "東大手",
          lat: 35.183727,
          lng: 136.908376,
        },
        {
          name: "清水",
          lat: 35.187152,
          lng: 136.913814,
        },
        {
          name: "尼ヶ坂",
          lat: 35.187957,
          lng: 136.91928,
        },
        {
          name: "森下",
          lat: 35.188299,
          lng: 136.929657,
        },
        {
          name: "大曽根",
          lat: 35.1916,
          lng: 136.936855,
          transfer: true,
          groupId: 1141105,
        },
        {
          name: "矢田",
          lat: 35.193699,
          lng: 136.947802,
        },
        {
          name: "守山自衛隊前",
          lat: 35.196258,
          lng: 136.957843,
          transfer: true,
          groupId: 3001208,
        },
        {
          name: "瓢箪山",
          lat: 35.197222,
          lng: 136.965048,
        },
        {
          name: "小幡",
          lat: 35.200216,
          lng: 136.975769,
        },
        {
          name: "喜多山",
          lat: 35.205099,
          lng: 136.987735,
        },
        {
          name: "大森・金城学院前",
          lat: 35.206934,
          lng: 136.996465,
        },
        {
          name: "印場",
          lat: 35.211085,
          lng: 137.011132,
        },
        {
          name: "旭前",
          lat: 35.214162,
          lng: 137.019706,
        },
        {
          name: "尾張旭",
          lat: 35.216743,
          lng: 137.036393,
        },
        {
          name: "三郷",
          lat: 35.216258,
          lng: 137.052352,
        },
        {
          name: "水野",
          lat: 35.224296,
          lng: 137.069659,
        },
        {
          name: "新瀬戸",
          lat: 35.225485,
          lng: 137.077639,
          transfer: true,
          groupId: 3001218,
        },
        {
          name: "瀬戸市役所前",
          lat: 35.224986,
          lng: 137.084177,
        },
        {
          name: "尾張瀬戸",
          lat: 35.225094,
          lng: 137.09727,
        },
      ],
    },
    {
      id: "30013",
      nameKo: "쓰시마선",
      nameJp: "名鉄津島線",
      color: "#009944",
      stations: [
        {
          name: "須ヶ口",
          lat: 35.198684,
          lng: 136.846229,
          transfer: true,
          groupId: 3000142,
        },
        {
          name: "甚目寺",
          lat: 35.195953,
          lng: 136.825492,
        },
        {
          name: "七宝",
          lat: 35.195775,
          lng: 136.806413,
        },
        {
          name: "木田",
          lat: 35.195328,
          lng: 136.787865,
        },
        {
          name: "青塚",
          lat: 35.198674,
          lng: 136.76708,
        },
        {
          name: "勝幡",
          lat: 35.195143,
          lng: 136.750082,
        },
        {
          name: "藤浪",
          lat: 35.188911,
          lng: 136.738766,
        },
        {
          name: "津島",
          lat: 35.177982,
          lng: 136.730995,
          transfer: true,
          groupId: 3001308,
        },
      ],
    },
    {
      id: "30014",
      nameKo: "비사이선",
      nameJp: "名鉄尾西線",
      color: "#009944",
      stations: [
        {
          name: "弥富",
          lat: 35.114026,
          lng: 136.725664,
          transfer: true,
          groupId: 1150806,
        },
        {
          name: "五ノ三",
          lat: 35.129838,
          lng: 136.711464,
        },
        {
          name: "佐屋",
          lat: 35.147552,
          lng: 136.716612,
        },
        {
          name: "日比野",
          lat: 35.163258,
          lng: 136.728351,
        },
        {
          name: "津島",
          lat: 35.177982,
          lng: 136.730995,
          transfer: true,
          groupId: 3001308,
        },
        {
          name: "町方",
          lat: 35.18898,
          lng: 136.727551,
        },
        {
          name: "六輪",
          lat: 35.202395,
          lng: 136.729306,
        },
        {
          name: "渕高",
          lat: 35.213944,
          lng: 136.727256,
        },
        {
          name: "丸渕",
          lat: 35.222635,
          lng: 136.728991,
        },
        {
          name: "上丸渕",
          lat: 35.233809,
          lng: 136.732521,
        },
        {
          name: "森上",
          lat: 35.247229,
          lng: 136.736698,
        },
        {
          name: "山崎",
          lat: 35.256548,
          lng: 136.739372,
        },
        {
          name: "玉野",
          lat: 35.266327,
          lng: 136.747982,
        },
        {
          name: "萩原",
          lat: 35.277157,
          lng: 136.757703,
        },
        {
          name: "二子",
          lat: 35.283986,
          lng: 136.766268,
        },
        {
          name: "苅安賀",
          lat: 35.287194,
          lng: 136.778275,
        },
        {
          name: "観音寺",
          lat: 35.289716,
          lng: 136.786191,
        },
        {
          name: "名鉄一宮",
          lat: 35.30154,
          lng: 136.797225,
          transfer: true,
          groupId: 1150237,
        },
        {
          name: "西一宮",
          lat: 35.307603,
          lng: 136.791948,
        },
        {
          name: "開明",
          lat: 35.31926,
          lng: 136.7741,
        },
        {
          name: "奥町",
          lat: 35.32434,
          lng: 136.761092,
        },
        {
          name: "玉ノ井",
          lat: 35.334887,
          lng: 136.757968,
        },
      ],
    },
    {
      id: "30015",
      nameKo: "이누야마선",
      nameJp: "名鉄犬山線",
      color: "#E60012",
      stations: [
        {
          name: "名鉄名古屋",
          lat: 35.169252,
          lng: 136.884187,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "栄生",
          lat: 35.183687,
          lng: 136.873051,
          transfer: true,
          groupId: 3000137,
        },
        {
          name: "東枇杷島",
          lat: 35.189808,
          lng: 136.870168,
          transfer: true,
          groupId: 3000138,
        },
        {
          name: "下小田井",
          lat: 35.201878,
          lng: 136.870638,
        },
        {
          name: "中小田井",
          lat: 35.214647,
          lng: 136.876772,
        },
        {
          name: "上小田井",
          lat: 35.223482,
          lng: 136.876941,
          transfer: true,
          groupId: 3001506,
        },
        {
          name: "西春",
          lat: 35.244627,
          lng: 136.871235,
        },
        {
          name: "徳重・名古屋芸大",
          lat: 35.256045,
          lng: 136.873384,
        },
        {
          name: "大山寺",
          lat: 35.263508,
          lng: 136.874748,
        },
        {
          name: "岩倉",
          lat: 35.277972,
          lng: 136.873511,
        },
        {
          name: "石仏",
          lat: 35.295545,
          lng: 136.871144,
        },
        {
          name: "布袋",
          lat: 35.317135,
          lng: 136.872987,
        },
        {
          name: "江南",
          lat: 35.33475,
          lng: 136.872109,
        },
        {
          name: "柏森",
          lat: 35.344807,
          lng: 136.900181,
        },
        {
          name: "扶桑",
          lat: 35.359557,
          lng: 136.91597,
        },
        {
          name: "木津用水",
          lat: 35.366914,
          lng: 136.925977,
        },
        {
          name: "犬山口",
          lat: 35.374212,
          lng: 136.939945,
        },
        {
          name: "犬山",
          lat: 35.379871,
          lng: 136.945536,
          transfer: true,
          groupId: 3001518,
        },
        {
          name: "犬山遊園",
          lat: 35.390331,
          lng: 136.946894,
        },
        {
          name: "新鵜沼",
          lat: 35.396799,
          lng: 136.944314,
          transfer: true,
          groupId: 1141606,
        },
      ],
    },
    {
      id: "30016",
      nameKo: "가카미가하라선",
      nameJp: "名鉄各務原線",
      color: "#6CBB5A",
      stations: [
        {
          name: "新鵜沼",
          lat: 35.396799,
          lng: 136.944314,
          transfer: true,
          groupId: 1141606,
        },
        {
          name: "鵜沼宿",
          lat: 35.400015,
          lng: 136.932567,
        },
        {
          name: "羽場",
          lat: 35.40119,
          lng: 136.921535,
        },
        {
          name: "苧ヶ瀬",
          lat: 35.403273,
          lng: 136.912266,
        },
        {
          name: "名電各務原",
          lat: 35.402518,
          lng: 136.900981,
        },
        {
          name: "二十軒",
          lat: 35.400098,
          lng: 136.889307,
        },
        {
          name: "三柿野",
          lat: 35.400156,
          lng: 136.876084,
        },
        {
          name: "六軒",
          lat: 35.40105,
          lng: 136.861554,
        },
        {
          name: "各務原市役所前",
          lat: 35.400869,
          lng: 136.847067,
        },
        {
          name: "市民公園前",
          lat: 35.400572,
          lng: 136.841829,
        },
        {
          name: "新那加",
          lat: 35.400097,
          lng: 136.83386,
        },
        {
          name: "新加納",
          lat: 35.39938,
          lng: 136.824414,
        },
        {
          name: "高田橋",
          lat: 35.398383,
          lng: 136.811488,
        },
        {
          name: "手力",
          lat: 35.398269,
          lng: 136.804472,
        },
        {
          name: "切通",
          lat: 35.400257,
          lng: 136.79564,
        },
        {
          name: "細畑",
          lat: 35.401637,
          lng: 136.785141,
        },
        {
          name: "田神",
          lat: 35.411261,
          lng: 136.772189,
        },
        {
          name: "名鉄岐阜",
          lat: 35.41163,
          lng: 136.760602,
          transfer: true,
          groupId: 3000160,
        },
      ],
    },
    {
      id: "30017",
      nameKo: "히로미선",
      nameJp: "名鉄広見線",
      color: "#009688",
      stations: [
        {
          name: "犬山",
          lat: 35.379871,
          lng: 136.945536,
          transfer: true,
          groupId: 3001518,
        },
        {
          name: "富岡前",
          lat: 35.379508,
          lng: 136.962112,
        },
        {
          name: "善師野",
          lat: 35.389744,
          lng: 136.980027,
        },
        {
          name: "西可児",
          lat: 35.404685,
          lng: 137.010616,
        },
        {
          name: "可児川",
          lat: 35.41812,
          lng: 137.01847,
        },
        {
          name: "日本ライン今渡",
          lat: 35.432302,
          lng: 137.036818,
        },
        {
          name: "新可児",
          lat: 35.423282,
          lng: 137.055622,
          transfer: true,
          groupId: 1150706,
        },
        {
          name: "明智",
          lat: 35.433208,
          lng: 137.087295,
        },
        {
          name: "顔戸",
          lat: 35.434522,
          lng: 137.105154,
        },
        {
          name: "御嵩口",
          lat: 35.431281,
          lng: 137.121741,
        },
        {
          name: "御嵩",
          lat: 35.429723,
          lng: 137.127527,
        },
      ],
    },
    {
      id: "30018",
      nameKo: "고마키선",
      nameJp: "名鉄小牧線",
      color: "#00ACA6",
      stations: [
        {
          name: "上飯田",
          lat: 35.203845,
          lng: 136.929642,
          transfer: true,
          groupId: 3001801,
        },
        {
          name: "味鋺",
          lat: 35.222478,
          lng: 136.936113,
        },
        {
          name: "味美",
          lat: 35.235209,
          lng: 136.937134,
        },
        {
          name: "春日井",
          lat: 35.25035,
          lng: 136.936228,
        },
        {
          name: "牛山",
          lat: 35.264014,
          lng: 136.931356,
        },
        {
          name: "間内",
          lat: 35.271585,
          lng: 136.9312,
        },
        {
          name: "小牧口",
          lat: 35.281717,
          lng: 136.927675,
        },
        {
          name: "小牧",
          lat: 35.28915,
          lng: 136.928461,
        },
        {
          name: "小牧原",
          lat: 35.300145,
          lng: 136.935836,
        },
        {
          name: "味岡",
          lat: 35.309301,
          lng: 136.940304,
        },
        {
          name: "田県神社前",
          lat: 35.317422,
          lng: 136.943675,
        },
        {
          name: "楽田",
          lat: 35.330548,
          lng: 136.950101,
        },
        {
          name: "羽黒",
          lat: 35.351519,
          lng: 136.952486,
        },
        {
          name: "犬山",
          lat: 35.379871,
          lng: 136.945536,
          transfer: true,
          groupId: 3001518,
        },
      ],
    },
    {
      id: "30020",
      nameKo: "다케하나선",
      nameJp: "名鉄竹鼻線",
      color: "#F7B52C",
      stations: [
        {
          name: "笠松",
          lat: 35.37466,
          lng: 136.764664,
          transfer: true,
          groupId: 3000156,
        },
        {
          name: "西笠松",
          lat: 35.36906,
          lng: 136.757901,
        },
        {
          name: "柳津",
          lat: 35.364925,
          lng: 136.737103,
        },
        {
          name: "南宿",
          lat: 35.347869,
          lng: 136.728604,
        },
        {
          name: "須賀",
          lat: 35.340192,
          lng: 136.726805,
        },
        {
          name: "不破一色",
          lat: 35.332959,
          lng: 136.721897,
        },
        {
          name: "竹鼻",
          lat: 35.326734,
          lng: 136.706399,
        },
        {
          name: "羽島市役所前",
          lat: 35.321924,
          lng: 136.70003,
        },
        {
          name: "江吉良",
          lat: 35.31543,
          lng: 136.699686,
          transfer: true,
          groupId: 3002009,
        },
      ],
    },
    {
      id: "30021",
      nameKo: "하시마선",
      nameJp: "名鉄羽島線",
      color: "#F7B52C",
      stations: [
        {
          name: "江吉良",
          lat: 35.31543,
          lng: 136.699686,
          transfer: true,
          groupId: 3002009,
        },
        {
          name: "新羽島",
          lat: 35.315471,
          lng: 136.686582,
        },
      ],
    },
  ],
  "名古屋臨海高速鉄道": [
    {
      id: "99509",
      nameKo: "아오나미선",
      nameJp: "あおなみ線",
      color: "#0067C0",
      stations: [
        {
          name: "名古屋",
          lat: 35.168733,
          lng: 136.882417,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "ささしまライブ",
          lat: 35.161745,
          lng: 136.881815,
          transfer: true,
          groupId: 3102702,
        },
        {
          name: "小本",
          lat: 35.14921,
          lng: 136.861331,
        },
        {
          name: "荒子",
          lat: 35.139992,
          lng: 136.861676,
        },
        {
          name: "南荒子",
          lat: 35.131707,
          lng: 136.861771,
        },
        {
          name: "中島",
          lat: 35.125144,
          lng: 136.861346,
        },
        {
          name: "港北",
          lat: 35.114529,
          lng: 136.862739,
        },
        {
          name: "荒子川公園",
          lat: 35.104569,
          lng: 136.861148,
        },
        {
          name: "稲永",
          lat: 35.091418,
          lng: 136.863203,
        },
        {
          name: "野跡",
          lat: 35.075253,
          lng: 136.854136,
        },
        {
          name: "金城ふ頭",
          lat: 35.048775,
          lng: 136.849009,
        },
      ],
    },
  ],
  "東海交通事業": [
    {
      id: "99510",
      nameKo: "조호쿠선",
      nameJp: "東海交通事業城北線",
      color: "#EE7800",
      stations: [
        {
          name: "枇杷島",
          lat: 35.198681,
          lng: 136.861816,
          transfer: true,
          groupId: 1150234,
        },
        {
          name: "尾張星の宮",
          lat: 35.212988,
          lng: 136.855011,
        },
        {
          name: "小田井",
          lat: 35.221043,
          lng: 136.880491,
        },
        {
          name: "比良",
          lat: 35.228549,
          lng: 136.90178,
        },
        {
          name: "味美",
          lat: 35.229504,
          lng: 136.932263,
        },
        {
          name: "勝川",
          lat: 35.227821,
          lng: 136.952734,
          transfer: true,
          groupId: 1141107,
        },
      ],
    },
  ],
  "愛知環状鉄道": [
    {
      id: "99511",
      nameKo: "아이치 순환철도선",
      nameJp: "愛知環状鉄道線",
      color: "#00913A",
      stations: [
        {
          name: "岡崎",
          lat: 34.925417,
          lng: 137.157243,
          transfer: true,
          groupId: 1150219,
        },
        {
          name: "六名",
          lat: 34.941132,
          lng: 137.152004,
        },
        {
          name: "中岡崎",
          lat: 34.956231,
          lng: 137.152723,
          transfer: true,
          groupId: 3000114,
        },
        {
          name: "北岡崎",
          lat: 34.972301,
          lng: 137.157736,
        },
        {
          name: "大門",
          lat: 34.982411,
          lng: 137.154883,
        },
        {
          name: "北野桝塚",
          lat: 34.996289,
          lng: 137.139457,
        },
        {
          name: "三河上郷",
          lat: 35.012384,
          lng: 137.132756,
        },
        {
          name: "永覚",
          lat: 35.027361,
          lng: 137.138983,
        },
        {
          name: "末野原",
          lat: 35.03949,
          lng: 137.146866,
        },
        {
          name: "三河豊田",
          lat: 35.0554,
          lng: 137.150934,
        },
        {
          name: "新上挙母",
          lat: 35.071732,
          lng: 137.151206,
        },
        {
          name: "新豊田",
          lat: 35.088041,
          lng: 137.153524,
        },
        {
          name: "愛環梅坪",
          lat: 35.105056,
          lng: 137.160781,
        },
        {
          name: "四郷",
          lat: 35.12211,
          lng: 137.162635,
        },
        {
          name: "貝津",
          lat: 35.133089,
          lng: 137.148091,
        },
        {
          name: "保見",
          lat: 35.136665,
          lng: 137.134363,
        },
        {
          name: "篠原",
          lat: 35.155171,
          lng: 137.120592,
        },
        {
          name: "八草",
          lat: 35.175404,
          lng: 137.106945,
          transfer: true,
          groupId: 9951118,
        },
        {
          name: "山口",
          lat: 35.197656,
          lng: 137.102089,
        },
        {
          name: "瀬戸口",
          lat: 35.206679,
          lng: 137.081866,
        },
        {
          name: "瀬戸市",
          lat: 35.225921,
          lng: 137.078452,
          transfer: true,
          groupId: 3001218,
        },
        {
          name: "中水野",
          lat: 35.250399,
          lng: 137.071947,
        },
        {
          name: "高蔵寺",
          lat: 35.26434,
          lng: 137.043766,
          transfer: true,
          groupId: 1141110,
        },
      ],
    },
  ],
  "愛知高速交通": [
    {
      id: "99512",
      nameKo: "리니모",
      nameJp: "リニモ",
      color: "#0068B7",
      stations: [
        {
          name: "藤が丘",
          lat: 35.182113,
          lng: 137.02171,
          transfer: true,
          groupId: 9951201,
        },
        {
          name: "はなみずき通",
          lat: 35.17767,
          lng: 137.035369,
        },
        {
          name: "杁ヶ池公園",
          lat: 35.171788,
          lng: 137.037866,
        },
        {
          name: "長久手古戦場",
          lat: 35.171574,
          lng: 137.049932,
        },
        {
          name: "芸大通",
          lat: 35.171938,
          lng: 137.061092,
        },
        {
          name: "公園西",
          lat: 35.174403,
          lng: 137.076737,
        },
        {
          name: "愛・地球博記念公園",
          lat: 35.177948,
          lng: 137.08796,
        },
        {
          name: "陶磁資料館南",
          lat: 35.179286,
          lng: 137.097099,
        },
        {
          name: "八草",
          lat: 35.176623,
          lng: 137.106366,
          transfer: true,
          groupId: 9951118,
        },
      ],
    },
  ],
  "名古屋市交通局": [
    {
      id: "99513",
      nameKo: "히가시야마선",
      nameJp: "名古屋市営地下鉄東山線",
      color: "#FFCC00",
      stations: [
        {
          name: "高畑",
          lat: 35.139161,
          lng: 136.853466,
        },
        {
          name: "八田",
          lat: 35.148986,
          lng: 136.853278,
          transfer: true,
          groupId: 1150802,
        },
        {
          name: "岩塚",
          lat: 35.158459,
          lng: 136.854406,
        },
        {
          name: "中村公園",
          lat: 35.16783,
          lng: 136.855056,
        },
        {
          name: "中村日赤",
          lat: 35.172385,
          lng: 136.861733,
        },
        {
          name: "本陣",
          lat: 35.177135,
          lng: 136.866782,
        },
        {
          name: "亀島",
          lat: 35.177526,
          lng: 136.876756,
        },
        {
          name: "名古屋",
          lat: 35.171252,
          lng: 136.883925,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "伏見",
          lat: 35.169273,
          lng: 136.897427,
          transfer: true,
          groupId: 9951309,
        },
        {
          name: "栄",
          lat: 35.16999,
          lng: 136.908031,
          transfer: true,
          groupId: 3001201,
        },
        {
          name: "新栄町",
          lat: 35.170729,
          lng: 136.920377,
        },
        {
          name: "千種",
          lat: 35.170625,
          lng: 136.930402,
          transfer: true,
          groupId: 1141104,
        },
        {
          name: "今池",
          lat: 35.169919,
          lng: 136.937331,
          transfer: true,
          groupId: 9951313,
        },
        {
          name: "池下",
          lat: 35.167675,
          lng: 136.946486,
        },
        {
          name: "覚王山",
          lat: 35.166565,
          lng: 136.953708,
        },
        {
          name: "本山",
          lat: 35.163923,
          lng: 136.963441,
          transfer: true,
          groupId: 9951316,
        },
        {
          name: "東山公園",
          lat: 35.160454,
          lng: 136.972873,
        },
        {
          name: "星ヶ丘",
          lat: 35.162399,
          lng: 136.985095,
        },
        {
          name: "一社",
          lat: 35.168231,
          lng: 136.995927,
        },
        {
          name: "上社",
          lat: 35.173656,
          lng: 137.007081,
        },
        {
          name: "本郷",
          lat: 35.175453,
          lng: 137.013425,
        },
        {
          name: "藤が丘",
          lat: 35.182415,
          lng: 137.021361,
          transfer: true,
          groupId: 9951201,
        },
      ],
    },
    {
      id: "99514",
      nameKo: "메이조선",
      nameJp: "名古屋市営地下鉄名城線",
      color: "#9B74C1",
      stations: [
        {
          name: "ナゴヤドーム前矢田",
          lat: 35.190691,
          lng: 136.945255,
          transfer: true,
          groupId: 9951401,
        },
        {
          name: "大曽根",
          lat: 35.192385,
          lng: 136.937204,
          transfer: true,
          groupId: 1141105,
        },
        {
          name: "平安通",
          lat: 35.195934,
          lng: 136.929784,
          transfer: true,
          groupId: 9951403,
        },
        {
          name: "志賀本通",
          lat: 35.196281,
          lng: 136.92121,
        },
        {
          name: "黒川",
          lat: 35.197183,
          lng: 136.910178,
        },
        {
          name: "名城公園",
          lat: 35.190528,
          lng: 136.904748,
        },
        {
          name: "名古屋城",
          lat: 35.18156,
          lng: 136.905379,
        },
        {
          name: "久屋大通",
          lat: 35.173784,
          lng: 136.908156,
          transfer: true,
          groupId: 9951408,
        },
        {
          name: "栄",
          lat: 35.16999,
          lng: 136.908031,
          transfer: true,
          groupId: 3001201,
        },
        {
          name: "矢場町",
          lat: 35.163785,
          lng: 136.90899,
        },
        {
          name: "上前津",
          lat: 35.157477,
          lng: 136.906815,
          transfer: true,
          groupId: 9951411,
        },
        {
          name: "東別院",
          lat: 35.150453,
          lng: 136.904824,
        },
        {
          name: "金山",
          lat: 35.14352,
          lng: 136.901611,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "西高蔵",
          lat: 35.134622,
          lng: 136.901769,
        },
        {
          name: "熱田神宮西",
          lat: 35.127956,
          lng: 136.906769,
        },
        {
          name: "熱田神宮伝馬町",
          lat: 35.120735,
          lng: 136.91038,
        },
        {
          name: "堀田",
          lat: 35.116644,
          lng: 136.921685,
        },
        {
          name: "妙音通",
          lat: 35.117125,
          lng: 136.929545,
        },
        {
          name: "新瑞橋",
          lat: 35.117734,
          lng: 136.936603,
          transfer: true,
          groupId: 9951419,
        },
        {
          name: "瑞穂運動場東",
          lat: 35.123167,
          lng: 136.948685,
        },
        {
          name: "総合リハビリセンター",
          lat: 35.130536,
          lng: 136.954523,
        },
        {
          name: "八事",
          lat: 35.136946,
          lng: 136.964036,
          transfer: true,
          groupId: 9951422,
        },
        {
          name: "八事日赤",
          lat: 35.144556,
          lng: 136.965008,
        },
        {
          name: "名古屋大学",
          lat: 35.154261,
          lng: 136.96658,
        },
        {
          name: "本山",
          lat: 35.163923,
          lng: 136.963441,
          transfer: true,
          groupId: 9951316,
        },
        {
          name: "自由ヶ丘",
          lat: 35.174961,
          lng: 136.966762,
        },
        {
          name: "茶屋ヶ坂",
          lat: 35.184612,
          lng: 136.962254,
        },
        {
          name: "砂田橋",
          lat: 35.188861,
          lng: 136.953999,
          transfer: true,
          groupId: 9951428,
        },
      ],
    },
    {
      id: "99515",
      nameKo: "메이코선",
      nameJp: "名古屋市営地下鉄名港線",
      color: "#0473BE",
      stations: [
        {
          name: "金山",
          lat: 35.14352,
          lng: 136.901611,
          transfer: true,
          groupId: 1141102,
        },
        {
          name: "日比野",
          lat: 35.132711,
          lng: 136.893125,
        },
        {
          name: "六番町",
          lat: 35.124623,
          lng: 136.888715,
        },
        {
          name: "東海通",
          lat: 35.113388,
          lng: 136.887336,
        },
        {
          name: "港区役所",
          lat: 35.105736,
          lng: 136.88455,
        },
        {
          name: "築地口",
          lat: 35.099348,
          lng: 136.883162,
        },
        {
          name: "名古屋港",
          lat: 35.09348,
          lng: 136.881971,
        },
      ],
    },
    {
      id: "99516",
      nameKo: "쓰루마이선",
      nameJp: "名古屋市営地下鉄鶴舞線",
      color: "#04ACDD",
      stations: [
        {
          name: "上小田井",
          lat: 35.223482,
          lng: 136.876941,
          transfer: true,
          groupId: 3001506,
        },
        {
          name: "庄内緑地公園",
          lat: 35.215186,
          lng: 136.886963,
        },
        {
          name: "庄内通",
          lat: 35.204476,
          lng: 136.891044,
        },
        {
          name: "浄心",
          lat: 35.192205,
          lng: 136.890819,
        },
        {
          name: "浅間町",
          lat: 35.18384,
          lng: 136.890335,
        },
        {
          name: "丸の内",
          lat: 35.173458,
          lng: 136.896944,
          transfer: true,
          groupId: 9951606,
        },
        {
          name: "伏見",
          lat: 35.169273,
          lng: 136.897427,
          transfer: true,
          groupId: 9951309,
        },
        {
          name: "大須観音",
          lat: 35.160729,
          lng: 136.898158,
        },
        {
          name: "上前津",
          lat: 35.157477,
          lng: 136.906815,
          transfer: true,
          groupId: 9951411,
        },
        {
          name: "鶴舞",
          lat: 35.15596,
          lng: 136.916749,
          transfer: true,
          groupId: 1141103,
        },
        {
          name: "荒畑",
          lat: 35.149654,
          lng: 136.92593,
        },
        {
          name: "御器所",
          lat: 35.149585,
          lng: 136.934146,
          transfer: true,
          groupId: 9951612,
        },
        {
          name: "川名",
          lat: 35.148703,
          lng: 136.948717,
        },
        {
          name: "いりなか",
          lat: 35.143234,
          lng: 136.955375,
        },
        {
          name: "八事",
          lat: 35.136946,
          lng: 136.964036,
          transfer: true,
          groupId: 9951422,
        },
        {
          name: "塩釜口",
          lat: 35.132433,
          lng: 136.977529,
        },
        {
          name: "植田",
          lat: 35.128649,
          lng: 136.987882,
        },
        {
          name: "原",
          lat: 35.126118,
          lng: 136.996714,
        },
        {
          name: "平針",
          lat: 35.122766,
          lng: 137.006904,
        },
        {
          name: "赤池",
          lat: 35.121097,
          lng: 137.017978,
          transfer: true,
          groupId: 3000609,
        },
      ],
    },
    {
      id: "99517",
      nameKo: "사쿠라도리선",
      nameJp: "名古屋市営地下鉄桜通線",
      color: "#FF0000",
      stations: [
        {
          name: "太閤通",
          lat: 35.167611,
          lng: 136.873126,
        },
        {
          name: "名古屋",
          lat: 35.170761,
          lng: 136.882546,
          transfer: true,
          groupId: 1141101,
        },
        {
          name: "国際センター",
          lat: 35.172128,
          lng: 136.889375,
        },
        {
          name: "丸の内",
          lat: 35.173098,
          lng: 136.898113,
          transfer: true,
          groupId: 9951606,
        },
        {
          name: "久屋大通",
          lat: 35.173784,
          lng: 136.908156,
          transfer: true,
          groupId: 9951408,
        },
        {
          name: "高岳",
          lat: 35.174062,
          lng: 136.915656,
        },
        {
          name: "車道",
          lat: 35.173507,
          lng: 136.929543,
        },
        {
          name: "今池",
          lat: 35.169919,
          lng: 136.937331,
          transfer: true,
          groupId: 9951313,
        },
        {
          name: "吹上",
          lat: 35.158787,
          lng: 136.935376,
        },
        {
          name: "御器所",
          lat: 35.149585,
          lng: 136.934146,
          transfer: true,
          groupId: 9951612,
        },
        {
          name: "桜山",
          lat: 35.139695,
          lng: 136.933316,
        },
        {
          name: "瑞穂区役所",
          lat: 35.131793,
          lng: 136.93443,
        },
        {
          name: "瑞穂運動場西",
          lat: 35.124949,
          lng: 136.935477,
        },
        {
          name: "新瑞橋",
          lat: 35.117734,
          lng: 136.936603,
          transfer: true,
          groupId: 9951419,
        },
        {
          name: "桜本町",
          lat: 35.109001,
          lng: 136.936761,
        },
        {
          name: "鶴里",
          lat: 35.105738,
          lng: 136.943433,
        },
        {
          name: "野並",
          lat: 35.102358,
          lng: 136.95549,
        },
        {
          name: "鳴子北",
          lat: 35.102684,
          lng: 136.966209,
        },
        {
          name: "相生山",
          lat: 35.102545,
          lng: 136.976208,
        },
        {
          name: "神沢",
          lat: 35.098518,
          lng: 136.98954,
        },
        {
          name: "徳重",
          lat: 35.094491,
          lng: 136.99815,
        },
      ],
    },
    {
      id: "99518",
      nameKo: "가미이다선",
      nameJp: "名古屋市営地下鉄上飯田線",
      color: "#FF66C4",
      stations: [
        {
          name: "平安通",
          lat: 35.195934,
          lng: 136.929784,
          transfer: true,
          groupId: 9951403,
        },
        {
          name: "上飯田",
          lat: 35.203845,
          lng: 136.929642,
          transfer: true,
          groupId: 3001801,
        },
      ],
    },
  ],
  "名古屋ガイドウェイバス": [
    {
      id: "99523",
      nameKo: "유토리토 라인",
      nameJp: "ゆとりーとライン",
      color: "#EA5504",
      stations: [
        {
          name: "大曽根",
          lat: 35.191372,
          lng: 136.937494,
          transfer: true,
          groupId: 1141105,
        },
        {
          name: "ナゴヤドーム前矢田",
          lat: 35.19025,
          lng: 136.947407,
          transfer: true,
          groupId: 9951401,
        },
        {
          name: "砂田橋",
          lat: 35.188821,
          lng: 136.954268,
          transfer: true,
          groupId: 9951428,
        },
        {
          name: "守山",
          lat: 35.197431,
          lng: 136.956639,
          transfer: true,
          groupId: 3001208,
        },
        {
          name: "金屋",
          lat: 35.202551,
          lng: 136.956747,
        },
        {
          name: "川宮",
          lat: 35.210405,
          lng: 136.962047,
        },
        {
          name: "川村",
          lat: 35.214297,
          lng: 136.968591,
        },
        {
          name: "白沢渓谷",
          lat: 35.216121,
          lng: 136.978569,
        },
        {
          name: "小幡緑地",
          lat: 35.218785,
          lng: 136.982839,
        },
      ],
    },
  ],
};
