// 3개 미만의 노선을 가진 소규모 운영회사 데이터
export const opMinor = {
  "相模鉄道": [
    {
      id: "29001",
      nameKo: "본선",
      nameJp: "相鉄本線",
      color: "#FF6B6B",
      stations: [
        {
          name: "横浜",
          lat: 35.465852,
          lng: 139.621768,
          transfer: true
        },
        {
          name: "平沼橋",
          lat: 35.460355,
          lng: 139.616897
        },
        {
          name: "西横浜",
          lat: 35.453437,
          lng: 139.608745
        },
        {
          name: "天王町",
          lat: 35.453984,
          lng: 139.602554
        },
        {
          name: "星川",
          lat: 35.458634,
          lng: 139.594816
        },
        {
          name: "和田町",
          lat: 35.463597,
          lng: 139.586786
        },
        {
          name: "上星川",
          lat: 35.467694,
          lng: 139.580078
        },
        {
          name: "西谷",
          lat: 35.478092,
          lng: 139.565721
        },
        {
          name: "鶴ヶ峰",
          lat: 35.475031,
          lng: 139.549586
        },
        {
          name: "二俣川",
          lat: 35.463335,
          lng: 139.532207,
          transfer: true
        },
        {
          name: "希望ヶ丘",
          lat: 35.460399,
          lng: 139.5143
        },
        {
          name: "三ツ境",
          lat: 35.467779,
          lng: 139.502662
        },
        {
          name: "瀬谷",
          lat: 35.470412,
          lng: 139.482574
        },
        {
          name: "大和",
          lat: 35.469924,
          lng: 139.461383,
          transfer: true
        },
        {
          name: "相模大塚",
          lat: 35.470666,
          lng: 139.441232
        },
        {
          name: "さがみ野",
          lat: 35.471485,
          lng: 139.429055
        },
        {
          name: "かしわ台",
          lat: 35.466744,
          lng: 139.415851
        },
        {
          name: "海老名",
          lat: 35.453381,
          lng: 139.392074,
          transfer: true
        }
      ]
    },
    {
      id: "29002",
      nameKo: "이즈미노선",
      nameJp: "相鉄いずみ野線",
      color: "#4ECDC4",
      stations: [
        {
          name: "二俣川",
          lat: 35.463335,
          lng: 139.532207,
          transfer: true
        },
        {
          name: "南万騎が原",
          lat: 35.452522,
          lng: 139.526344
        },
        {
          name: "緑園都市",
          lat: 35.439502,
          lng: 139.521841
        },
        {
          name: "弥生台",
          lat: 35.429933,
          lng: 139.506615
        },
        {
          name: "いずみ野",
          lat: 35.429434,
          lng: 139.495135
        },
        {
          name: "いずみ中央",
          lat: 35.415385,
          lng: 139.48727
        },
        {
          name: "ゆめが丘",
          lat: 35.405436,
          lng: 139.482192
        },
        {
          name: "湘南台",
          lat: 35.396642,
          lng: 139.467031,
          transfer: true
        }
      ]
    }
  ],
  "横浜高速鉄道": [
    {
      id: "99310",
      nameKo: "미나토미라이선",
      nameJp: "みなとみらい線",
      color: "#95E1D3",
      stations: [
        {
          name: "横浜",
          lat: 35.466372,
          lng: 139.622299,
          transfer: true
        },
        {
          name: "新高島",
          lat: 35.46192,
          lng: 139.626499
        },
        {
          name: "みなとみらい",
          lat: 35.458028,
          lng: 139.632386
        },
        {
          name: "馬車道",
          lat: 35.450135,
          lng: 139.636175
        },
        {
          name: "日本大通り",
          lat: 35.446821,
          lng: 139.642608
        },
        {
          name: "元町・中華街",
          lat: 35.44243,
          lng: 139.650446
        }
      ]
    }
  ],
  "横浜市交通局": [
    {
      id: "99316",
      nameKo: "블루라인",
      nameJp: "ブルーライン",
      color: "#3498DB",
      stations: [
        {
          name: "あざみ野",
          lat: 35.568076,
          lng: 139.553694,
          transfer: true
        },
        {
          name: "中川",
          lat: 35.562973,
          lng: 139.569846
        },
        {
          name: "センター北",
          lat: 35.55353,
          lng: 139.578457,
          transfer: true
        },
        {
          name: "センター南",
          lat: 35.545476,
          lng: 139.574291,
          transfer: true
        },
        {
          name: "仲町台",
          lat: 35.535258,
          lng: 139.589715
        },
        {
          name: "新羽",
          lat: 35.527701,
          lng: 139.612065
        },
        {
          name: "北新横浜",
          lat: 35.519271,
          lng: 139.612818
        },
        {
          name: "新横浜",
          lat: 35.508588,
          lng: 139.617745,
          transfer: true
        },
        {
          name: "岸根公園",
          lat: 35.496038,
          lng: 139.617065
        },
        {
          name: "片倉町",
          lat: 35.490205,
          lng: 139.606511
        },
        {
          name: "三ツ沢上町",
          lat: 35.476526,
          lng: 139.605395
        },
        {
          name: "三ツ沢下町",
          lat: 35.476512,
          lng: 139.61481
        },
        {
          name: "横浜",
          lat: 35.465826,
          lng: 139.619912,
          transfer: true
        },
        {
          name: "高島町",
          lat: 35.458804,
          lng: 139.623548
        },
        {
          name: "桜木町",
          lat: 35.449667,
          lng: 139.630791,
          transfer: true
        },
        {
          name: "関内",
          lat: 35.445821,
          lng: 139.635855,
          transfer: true
        },
        {
          name: "伊勢佐木長者町",
          lat: 35.441044,
          lng: 139.633176
        },
        {
          name: "阪東橋",
          lat: 35.437434,
          lng: 139.624843
        },
        {
          name: "吉野町",
          lat: 35.435489,
          lng: 139.618455
        },
        {
          name: "蒔田",
          lat: 35.429935,
          lng: 139.610123
        },
        {
          name: "弘明寺",
          lat: 35.423294,
          lng: 139.602081,
          transfer: true
        },
        {
          name: "上大岡",
          lat: 35.408745,
          lng: 139.595901,
          transfer: true
        },
        {
          name: "港南中央",
          lat: 35.401049,
          lng: 139.590958
        },
        {
          name: "上永谷",
          lat: 35.401391,
          lng: 139.572713
        },
        {
          name: "下永谷",
          lat: 35.402677,
          lng: 139.559389
        },
        {
          name: "舞岡",
          lat: 35.402685,
          lng: 139.551509
        },
        {
          name: "戸塚",
          lat: 35.400818,
          lng: 139.534328,
          transfer: true
        },
        {
          name: "踊場",
          lat: 35.405922,
          lng: 139.518058
        },
        {
          name: "中田",
          lat: 35.411161,
          lng: 139.511301
        },
        {
          name: "立場",
          lat: 35.414296,
          lng: 139.500177
        },
        {
          name: "下飯田",
          lat: 35.403503,
          lng: 139.483195
        },
        {
          name: "湘南台",
          lat: 35.396471,
          lng: 139.467283,
          transfer: true
        }
      ]
    },
    {
      id: "99343",
      nameKo: "그린라인",
      nameJp: "グリーンライン",
      color: "#2ECC71",
      stations: [
        {
          name: "中山",
          lat: 35.515029,
          lng: 139.54032,
          transfer: true
        },
        {
          name: "川和町",
          lat: 35.52802,
          lng: 139.548745
        },
        {
          name: "都筑ふれあいの丘",
          lat: 35.536583,
          lng: 139.561359
        },
        {
          name: "センター南",
          lat: 35.545863,
          lng: 139.574325,
          transfer: true
        },
        {
          name: "センター北",
          lat: 35.553534,
          lng: 139.578386,
          transfer: true
        },
        {
          name: "北山田",
          lat: 35.561077,
          lng: 139.592258
        },
        {
          name: "東山田",
          lat: 35.554302,
          lng: 139.604369
        },
        {
          name: "高田",
          lat: 35.549713,
          lng: 139.619944
        },
        {
          name: "日吉本町",
          lat: 35.549883,
          lng: 139.633554
        },
        {
          name: "日吉",
          lat: 35.553313,
          lng: 139.647008,
          transfer: true
        }
      ]
    }
  ],
  "東京臨海高速鉄道": [
    {
      id: "99337",
      nameKo: "린카이선",
      nameJp: "りんかい線",
      color: "#00D4AA",
      stations: [
        {
          name: "新木場",
          lat: 35.646172,
          lng: 139.827402,
          transfer: true
        },
        {
          name: "東雲",
          lat: 35.640987,
          lng: 139.804395
        },
        {
          name: "国際展示場",
          lat: 35.63441,
          lng: 139.791617
        },
        {
          name: "東京テレポート",
          lat: 35.62753,
          lng: 139.778896
        },
        {
          name: "天王洲アイル",
          lat: 35.620562,
          lng: 139.750793,
          transfer: true
        },
        {
          name: "品川シーサイド",
          lat: 35.608524,
          lng: 139.749549
        },
        {
          name: "大井町",
          lat: 35.607535,
          lng: 139.735025,
          transfer: true
        },
        {
          name: "大崎",
          lat: 35.619772,
          lng: 139.728439,
          transfer: true
        }
      ]
    }
  ],
  "首都圏新都市鉄道": [
    {
      id: "99309",
      nameKo: "츠쿠바 익스프레스",
      nameJp: "つくばエクスプレス",
      color: "#A29BFE",
      stations: [
        {
          name: "秋葉原",
          lat: 35.698889,
          lng: 139.774273,
          transfer: true
        },
        {
          name: "新御徒町",
          lat: 35.707045,
          lng: 139.781958,
          transfer: true
        },
        {
          name: "浅草",
          lat: 35.713817,
          lng: 139.792389,
          transfer: true
        },
        {
          name: "南千住",
          lat: 35.732413,
          lng: 139.798783,
          transfer: true
        },
        {
          name: "北千住",
          lat: 35.74949,
          lng: 139.805092,
          transfer: true
        },
        {
          name: "青井",
          lat: 35.771782,
          lng: 139.82038
        },
        {
          name: "六町",
          lat: 35.784963,
          lng: 139.821816
        },
        {
          name: "八潮",
          lat: 35.807905,
          lng: 139.845017
        },
        {
          name: "三郷中央",
          lat: 35.824514,
          lng: 139.878344
        },
        {
          name: "南流山",
          lat: 35.83869,
          lng: 139.903271,
          transfer: true
        },
        {
          name: "流山セントラルパーク",
          lat: 35.854552,
          lng: 139.915223
        },
        {
          name: "流山おおたかの森",
          lat: 35.871799,
          lng: 139.925044,
          transfer: true
        },
        {
          name: "柏の葉キャンパス",
          lat: 35.89308,
          lng: 139.952454
        },
        {
          name: "柏たなか",
          lat: 35.9109,
          lng: 139.957533
        },
        {
          name: "守谷",
          lat: 35.950626,
          lng: 139.992209
        },
        {
          name: "みらい平",
          lat: 35.99514,
          lng: 140.038555
        },
        {
          name: "みどりの",
          lat: 36.03025,
          lng: 140.056276
        },
        {
          name: "万博記念公園",
          lat: 36.05841,
          lng: 140.059256
        },
        {
          name: "研究学園",
          lat: 36.0821,
          lng: 140.082256
        },
        {
          name: "つくば",
          lat: 36.0825,
          lng: 140.110604
        }
      ]
    }
  ],
  "東京モノレール": [
    {
      id: "99336",
      nameKo: "하네다공항선",
      nameJp: "東京モノレール",
      color: "#74B9FF",
      stations: [
        {
          name: "モノレール浜松町",
          lat: 35.655666,
          lng: 139.756747,
          transfer: true
        },
        {
          name: "天王洲アイル",
          lat: 35.622908,
          lng: 139.750675,
          transfer: true
        },
        {
          name: "大井競馬場前",
          lat: 35.595006,
          lng: 139.74708
        },
        {
          name: "流通センター",
          lat: 35.58186,
          lng: 139.748964
        },
        {
          name: "昭和島",
          lat: 35.570656,
          lng: 139.749918
        },
        {
          name: "整備場",
          lat: 35.555125,
          lng: 139.753366
        },
        {
          name: "天空橋",
          lat: 35.548908,
          lng: 139.75423,
          transfer: true
        },
        {
          name: "羽田空港第3ターミナル",
          lat: 35.544169,
          lng: 139.768206,
          transfer: true
        },
        {
          name: "新整備場",
          lat: 35.542773,
          lng: 139.786777
        },
        {
          name: "羽田空港第1ターミナル",
          lat: 35.549163,
          lng: 139.784653,
          transfer: true
        },
        {
          name: "羽田空港第2ターミナル",
          lat: 35.550734,
          lng: 139.787979
        }
      ]
    }
  ],
  "多摩都市モノレール": [
    {
      id: "99334",
      nameKo: "다마 모노레일",
      nameJp: "多摩モノレール",
      color: "#FD79A8",
      stations: [
        {
          name: "多摩センター",
          lat: 35.623724,
          lng: 139.422782
        },
        {
          name: "松が谷",
          lat: 35.63169,
          lng: 139.422201
        },
        {
          name: "大塚・帝京大学",
          lat: 35.636878,
          lng: 139.416461
        },
        {
          name: "中央大学・明星大学",
          lat: 35.64197,
          lng: 139.408672
        },
        {
          name: "多摩動物公園",
          lat: 35.648666,
          lng: 139.403672,
          transfer: true
        },
        {
          name: "程久保",
          lat: 35.655093,
          lng: 139.410698
        },
        {
          name: "高幡不動",
          lat: 35.66148,
          lng: 139.415184,
          transfer: true
        },
        {
          name: "万願寺",
          lat: 35.671249,
          lng: 139.420079
        },
        {
          name: "甲州街道",
          lat: 35.678262,
          lng: 139.409191
        },
        {
          name: "柴崎体育館",
          lat: 35.689475,
          lng: 139.409191
        },
        {
          name: "立川南",
          lat: 35.696077,
          lng: 139.412546
        },
        {
          name: "立川北",
          lat: 35.699502,
          lng: 139.41254
        },
        {
          name: "高松",
          lat: 35.710158,
          lng: 139.413242
        },
        {
          name: "立飛",
          lat: 35.714717,
          lng: 139.417387
        },
        {
          name: "泉体育館",
          lat: 35.718775,
          lng: 139.419525
        },
        {
          name: "砂川七番",
          lat: 35.723319,
          lng: 139.418097
        },
        {
          name: "玉川上水",
          lat: 35.73223,
          lng: 139.417866,
          transfer: true
        },
        {
          name: "桜街道",
          lat: 35.739,
          lng: 139.416653
        },
        {
          name: "上北台",
          lat: 35.745824,
          lng: 139.415822
        }
      ]
    }
  ],
  "ゆりかもめ": [
    {
      id: "99311",
      nameKo: "유리카모메선",
      nameJp: "ゆりかもめ",
      color: "#FDCB6E",
      stations: [
        {
          name: "新橋",
          lat: 35.665503,
          lng: 139.759644,
          transfer: true
        },
        {
          name: "汐留",
          lat: 35.662871,
          lng: 139.759985,
          transfer: true
        },
        {
          name: "竹芝",
          lat: 35.654099,
          lng: 139.762037
        },
        {
          name: "日の出",
          lat: 35.649136,
          lng: 139.75906
        },
        {
          name: "芝浦ふ頭",
          lat: 35.641773,
          lng: 139.757852
        },
        {
          name: "お台場海浜公園",
          lat: 35.629813,
          lng: 139.778607
        },
        {
          name: "台場",
          lat: 35.625908,
          lng: 139.771435
        },
        {
          name: "東京国際クルーズターミナル",
          lat: 35.621462,
          lng: 139.773157
        },
        {
          name: "テレコムセンター",
          lat: 35.617593,
          lng: 139.779327
        },
        {
          name: "青海",
          lat: 35.62467,
          lng: 139.781132
        },
        {
          name: "東京ビッグサイト",
          lat: 35.630158,
          lng: 139.791228
        },
        {
          name: "有明",
          lat: 35.634596,
          lng: 139.793269
        },
        {
          name: "有明テニスの森",
          lat: 35.639964,
          lng: 139.78888
        },
        {
          name: "市場前",
          lat: 35.645684,
          lng: 139.78564
        },
        {
          name: "新豊洲",
          lat: 35.648718,
          lng: 139.789996
        },
        {
          name: "豊洲",
          lat: 35.653792,
          lng: 139.795414,
          transfer: true
        }
      ]
    }
  ],
  "埼玉高速鉄道": [
    {
      id: "99307",
      nameKo: "사이타마 고속철도선",
      nameJp: "埼玉高速鉄道線",
      color: "#E17055",
      stations: [
        {
          name: "赤羽岩淵",
          lat: 35.783417,
          lng: 139.722103,
          transfer: true
        },
        {
          name: "川口元郷",
          lat: 35.800187,
          lng: 139.730043
        },
        {
          name: "南鳩ヶ谷",
          lat: 35.816839,
          lng: 139.736059
        },
        {
          name: "鳩ヶ谷",
          lat: 35.830859,
          lng: 139.735967
        },
        {
          name: "新井宿",
          lat: 35.842974,
          lng: 139.737908
        },
        {
          name: "戸塚安行",
          lat: 35.858873,
          lng: 139.753689
        },
        {
          name: "東川口",
          lat: 35.876211,
          lng: 139.74398,
          transfer: true
        },
        {
          name: "浦和美園",
          lat: 35.893677,
          lng: 139.72779
        }
      ]
    }
  ],
  "埼玉新都市交通": [
    {
      id: "99321",
      nameKo: "이나선/뉴 셔틀",
      nameJp: "ニューシャトル",
      color: "#00B894",
      stations: [
        {
          name: "大宮",
          lat: 35.90751,
          lng: 139.62254,
          transfer: true
        },
        {
          name: "鉄道博物館",
          lat: 35.920271,
          lng: 139.617796
        },
        {
          name: "加茂宮",
          lat: 35.93568,
          lng: 139.616688
        },
        {
          name: "東宮原",
          lat: 35.94262,
          lng: 139.618054
        },
        {
          name: "今羽",
          lat: 35.949941,
          lng: 139.619443
        },
        {
          name: "吉野原",
          lat: 35.957065,
          lng: 139.620862
        },
        {
          name: "原市",
          lat: 35.964072,
          lng: 139.622531
        },
        {
          name: "沼南",
          lat: 35.971165,
          lng: 139.623481
        },
        {
          name: "丸山",
          lat: 35.97989,
          lng: 139.624711
        },
        {
          name: "志久",
          lat: 35.991099,
          lng: 139.62228
        },
        {
          name: "伊奈中央",
          lat: 35.999537,
          lng: 139.617094
        },
        {
          name: "羽貫",
          lat: 36.007311,
          lng: 139.608608
        },
        {
          name: "内宿",
          lat: 36.014163,
          lng: 139.599878
        }
      ]
    }
  ],
  "千葉都市モノレール": [
    {
      id: "99331",
      nameKo: "치바 도시 모노레일 1호선",
      nameJp: "千葉都市モノレール１号線",
      color: "#FAD02E",
      stations: [
        {
          name: "千葉みなと",
          lat: 35.607391,
          lng: 140.102495,
          transfer: true
        },
        {
          name: "市役所前",
          lat: 35.606878,
          lng: 140.107757,
          transfer: true
        },
        {
          name: "千葉",
          lat: 35.612084,
          lng: 140.114136,
          transfer: true
        },
        {
          name: "栄町",
          lat: 35.612822,
          lng: 140.118592,
          transfer: true
        },
        {
          name: "葭川公園",
          lat: 35.608551,
          lng: 140.120142
        },
        {
          name: "県庁前",
          lat: 35.603958,
          lng: 140.12222
        }
      ]
    },
    {
      id: "99332",
      nameKo: "치바 도시 모노레일 2호선",
      nameJp: "千葉都市モノレール２号線",
      color: "#F7A440",
      stations: [
        {
          name: "千葉みなと",
          lat: 35.607391,
          lng: 140.102495,
          transfer: true
        },
        {
          name: "市役所前",
          lat: 35.606878,
          lng: 140.107757,
          transfer: true
        },
        {
          name: "千葉",
          lat: 35.612084,
          lng: 140.114136,
          transfer: true
        },
        {
          name: "千葉公園",
          lat: 35.619774,
          lng: 140.117944
        },
        {
          name: "作草部",
          lat: 35.625806,
          lng: 140.115314
        },
        {
          name: "天台",
          lat: 35.631447,
          lng: 140.112902
        },
        {
          name: "穴川",
          lat: 35.639645,
          lng: 140.111849
        },
        {
          name: "スポーツセンター",
          lat: 35.643164,
          lng: 140.11611
        },
        {
          name: "動物公園",
          lat: 35.642585,
          lng: 140.125437
        },
        {
          name: "みつわ台",
          lat: 35.6387,
          lng: 140.134873
        },
        {
          name: "都賀",
          lat: 35.635491,
          lng: 140.148736,
          transfer: true
        },
        {
          name: "桜木",
          lat: 35.631308,
          lng: 140.160935
        },
        {
          name: "小倉台",
          lat: 35.627755,
          lng: 140.171873
        },
        {
          name: "千城台北",
          lat: 35.627436,
          lng: 140.181972
        },
        {
          name: "千城台",
          lat: 35.622314,
          lng: 140.18856
        }
      ]
    }
  ],
  "小湊鐵道": [
    {
      id: "99325",
      nameKo: "고미나토 철도선",
      nameJp: "小湊鉄道線",
      color: "#E67E22",
      stations: [
        {
          name: "五井",
          lat: 35.512985,
          lng: 140.089522,
          transfer: true
        },
        {
          name: "上総村上",
          lat: 35.496171,
          lng: 140.100355
        },
        {
          name: "海士有木",
          lat: 35.481729,
          lng: 140.124264
        },
        {
          name: "上総三又",
          lat: 35.46592,
          lng: 140.12672
        },
        {
          name: "上総山田",
          lat: 35.454105,
          lng: 140.126128
        },
        {
          name: "光風台",
          lat: 35.439662,
          lng: 140.114174
        },
        {
          name: "馬立",
          lat: 35.423795,
          lng: 140.114719
        },
        {
          name: "上総牛久",
          lat: 35.400213,
          lng: 140.142255
        },
        {
          name: "上総川間",
          lat: 35.388047,
          lng: 140.150968
        },
        {
          name: "上総鶴舞",
          lat: 35.381346,
          lng: 140.165006
        },
        {
          name: "上総久保",
          lat: 35.367481,
          lng: 140.154438
        },
        {
          name: "高滝",
          lat: 35.353074,
          lng: 140.150246
        },
        {
          name: "里見",
          lat: 35.336685,
          lng: 140.145505
        },
        {
          name: "飯給",
          lat: 35.320512,
          lng: 140.142358
        },
        {
          name: "月崎",
          lat: 35.302203,
          lng: 140.139394
        },
        {
          name: "上総大久保",
          lat: 35.283367,
          lng: 140.145924
        },
        {
          name: "養老渓谷",
          lat: 35.266409,
          lng: 140.159382
        },
        {
          name: "上総中野",
          lat: 35.250051,
          lng: 140.199571,
          transfer: true
        }
      ]
    }
  ],
  "いすみ鉄道": [
    {
      id: "99308",
      nameKo: "이수미선",
      nameJp: "いすみ線",
      color: "#27AE60",
      stations: [
        {
          name: "大原",
          lat: 35.251097,
          lng: 140.390864,
          transfer: true
        },
        {
          name: "西大原",
          lat: 35.260407,
          lng: 140.378029
        },
        {
          name: "上総東",
          lat: 35.263313,
          lng: 140.344974
        },
        {
          name: "新田野",
          lat: 35.276408,
          lng: 140.328081
        },
        {
          name: "国吉",
          lat: 35.280497,
          lng: 140.314046
        },
        {
          name: "上総中川",
          lat: 35.282763,
          lng: 140.280636
        },
        {
          name: "城見ヶ丘",
          lat: 35.291741,
          lng: 140.252693
        },
        {
          name: "大多喜",
          lat: 35.286466,
          lng: 140.243833
        },
        {
          name: "小谷松",
          lat: 35.268938,
          lng: 140.251142
        },
        {
          name: "東総元",
          lat: 35.259314,
          lng: 140.247381
        },
        {
          name: "久我原",
          lat: 35.250265,
          lng: 140.247718
        },
        {
          name: "総元",
          lat: 35.240588,
          lng: 140.240413
        },
        {
          name: "西畑",
          lat: 35.25051,
          lng: 140.215176
        },
        {
          name: "上総中野",
          lat: 35.250051,
          lng: 140.199571,
          transfer: true
        }
      ]
    }
  ],
  "日暮里・舎人ライナー": [
    {
      id: "99342",
      nameKo: "닛포리-토네리 라이너",
      nameJp: "日暮里・舎人ライナー",
      color: "#2980B9",
      stations: [
        {
          name: "日暮里",
          lat: 35.727908,
          lng: 139.771287,
          transfer: true
        },
        {
          name: "西日暮里",
          lat: 35.731954,
          lng: 139.766857,
          transfer: true
        },
        {
          name: "赤土小学校前",
          lat: 35.742454,
          lng: 139.768989
        },
        {
          name: "熊野前",
          lat: 35.748972,
          lng: 139.769695,
          transfer: true
        },
        {
          name: "足立小台",
          lat: 35.754658,
          lng: 139.770381
        },
        {
          name: "扇大橋",
          lat: 35.763897,
          lng: 139.770808
        },
        {
          name: "高野",
          lat: 35.768359,
          lng: 139.770679
        },
        {
          name: "江北",
          lat: 35.774021,
          lng: 139.770306
        },
        {
          name: "西新井大師西",
          lat: 35.781505,
          lng: 139.770094
        },
        {
          name: "谷在家",
          lat: 35.788774,
          lng: 139.770043
        },
        {
          name: "舎人公園",
          lat: 35.79623,
          lng: 139.770183
        },
        {
          name: "舎人",
          lat: 35.8057,
          lng: 139.770108
        },
        {
          name: "見沼代親水公園",
          lat: 35.814544,
          lng: 139.770719
        }
      ]
    }
  ],
  "北総鉄道": [
    {
      id: "99340",
      nameKo: "호쿠소선",
      nameJp: "北総鉄道北総線",
      color: "#6C5CE7",
      stations: [
        {
          name: "京成高砂",
          lat: 35.750932,
          lng: 139.866875,
          transfer: true
        },
        {
          name: "新柴又",
          lat: 35.75101,
          lng: 139.879376
        },
        {
          name: "矢切",
          lat: 35.757503,
          lng: 139.899742
        },
        {
          name: "北国分",
          lat: 35.762916,
          lng: 139.914252
        },
        {
          name: "秋山",
          lat: 35.765299,
          lng: 139.930723
        },
        {
          name: "東松戸",
          lat: 35.769954,
          lng: 139.942957,
          transfer: true
        },
        {
          name: "松飛台",
          lat: 35.775377,
          lng: 139.957739
        },
        {
          name: "大町",
          lat: 35.775103,
          lng: 139.973567
        },
        {
          name: "新鎌ヶ谷",
          lat: 35.779481,
          lng: 139.998361,
          transfer: true
        },
        {
          name: "西白井",
          lat: 35.784364,
          lng: 140.031545
        },
        {
          name: "白井",
          lat: 35.784723,
          lng: 140.0541
        },
        {
          name: "小室",
          lat: 35.787004,
          lng: 140.076073
        },
        {
          name: "千葉ニュータウン中央",
          lat: 35.800175,
          lng: 140.116159,
          transfer: true
        },
        {
          name: "印西牧の原",
          lat: 35.803608,
          lng: 140.166911
        },
        {
          name: "印旛日本医大",
          lat: 35.787512,
          lng: 140.203112,
          transfer: true
        }
      ]
    }
  ],
  "秩父鉄道": [
    {
      id: "99306",
      nameKo: "치치부 철도 본선",
      nameJp: "秩父鉄道秩父本線",
      color: "#F1C40F",
      stations: [
        {
          name: "羽生",
          lat: 36.170345,
          lng: 139.533949,
          transfer: true,
        },
        {
          name: "西羽生",
          lat: 36.17635,
          lng: 139.523986,
        },
        {
          name: "新郷",
          lat: 36.171317,
          lng: 139.510474,
        },
        {
          name: "武州荒木",
          lat: 36.162614,
          lng: 139.488569,
        },
        {
          name: "東行田",
          lat: 36.147265,
          lng: 139.468394,
        },
        {
          name: "行田市",
          lat: 36.143759,
          lng: 139.458851,
        },
        {
          name: "持田",
          lat: 36.137615,
          lng: 139.44155,
        },
        {
          name: "ソシオ流通センター",
          lat: 36.1365,
          lng: 139.424333,
        },
        {
          name: "熊谷",
          lat: 36.139313,
          lng: 139.389542,
          transfer: true,
        },
        {
          name: "上熊谷",
          lat: 36.142657,
          lng: 139.38134,
        },
        {
          name: "石原",
          lat: 36.147612,
          lng: 139.368901,
        },
        {
          name: "ひろせ野鳥の森",
          lat: 36.146242,
          lng: 139.352086,
        },
        {
          name: "大麻生",
          lat: 36.144612,
          lng: 139.331859,
        },
        {
          name: "明戸",
          lat: 36.142958,
          lng: 139.303306,
        },
        {
          name: "武川",
          lat: 36.142197,
          lng: 139.281714,
        },
        {
          name: "永田",
          lat: 36.135314,
          lng: 139.259516,
          transfer: true,
        },
        {
          name: "ふかや花園",
          lat: 36.132056,
          lng: 139.251472,
        },
        {
          name: "小前田",
          lat: 36.12895,
          lng: 139.222386,
        },
        {
          name: "桜沢",
          lat: 36.128672,
          lng: 139.206981,
        },
        {
          name: "寄居",
          lat: 36.117801,
          lng: 139.194197,
          transfer: true,
        },
        {
          name: "波久礼",
          lat: 36.126728,
          lng: 139.158078,
        },
        {
          name: "樋口",
          lat: 36.131076,
          lng: 139.122226,
        },
        {
          name: "野上",
          lat: 36.11157,
          lng: 139.110865,
        },
        {
          name: "長瀞",
          lat: 36.095462,
          lng: 139.112346,
        },
        {
          name: "上長瀞",
          lat: 36.086169,
          lng: 139.11319,
        },
        {
          name: "親鼻",
          lat: 36.077539,
          lng: 139.106103,
        },
        {
          name: "皆野",
          lat: 36.068682,
          lng: 139.093947,
        },
        {
          name: "和銅黒谷",
          lat: 36.046671,
          lng: 139.101666,
        },
        {
          name: "大野原",
          lat: 36.018586,
          lng: 139.094071,
        },
        {
          name: "秩父",
          lat: 35.99883,
          lng: 139.086044,
        },
        {
          name: "御花畑",
          lat: 35.992369,
          lng: 139.083614
        },
        {
          name: "影森",
          lat: 35.972015,
          lng: 139.068413,
        },
        {
          name: "浦山口",
          lat: 35.963922,
          lng: 139.058134,
        },
        {
          name: "武州中川",
          lat: 35.958347,
          lng: 139.035439,
        },
        {
          name: "武州日野",
          lat: 35.953867,
          lng: 139.021888,
        },
        {
          name: "白久",
          lat: 35.95895,
          lng: 138.993263,
        },
        {
          name: "三峰口",
          lat: 35.960075,
          lng: 138.978706,
        }
      ]
    }
  ],
  "東葉高速鉄道": [
    {
      id: "99338",
      nameKo: "도요 고속선",
      nameJp: "東葉高速線",
      color: "#FF7675",
      stations: [
        {
          name: "西船橋",
          lat: 35.707127,
          lng: 139.958972,
          transfer: true
        },
        {
          name: "東海神",
          lat: 35.705888,
          lng: 139.980343
        },
        {
          name: "飯山満",
          lat: 35.71407,
          lng: 140.0223
        },
        {
          name: "北習志野",
          lat: 35.721674,
          lng: 140.04236,
          transfer: true
        },
        {
          name: "船橋日大前",
          lat: 35.726931,
          lng: 140.058962
        },
        {
          name: "八千代緑が丘",
          lat: 35.728884,
          lng: 140.073461
        },
        {
          name: "八千代中央",
          lat: 35.727807,
          lng: 140.103713
        },
        {
          name: "村上",
          lat: 35.72371,
          lng: 140.118375
        },
        {
          name: "東葉勝田台",
          lat: 35.715458,
          lng: 140.126075,
          transfer: true
        }
      ]
    }
  ]
};
